#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура ПутьКПапкеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите папку с версией 1С";
	Диалог.МножественныйВыбор = Ложь;
	
	Если НЕ ПустаяСтрока(Объект.ПутьКПапке) Тогда
		Диалог.Каталог = Объект.ПутьКПапке;
	КонецЕсли;
	
	ВыбранныеФайлы = Ждать Диалог.ВыбратьАсинх();
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		Объект.ПутьКПапке = ВыбранныеФайлы[0];
	КонецЕсли;
КонецПроцедуры

#КонецОбласти