#Область СлужебныйПрограммныйИнтерфейс

Процедура ОткрытьПредприятиеФайловойБазы(ОписаниеИБ) Экспорт
	ОписаниеОповещенияПослеЗапуска = Новый ОписаниеОповещения("ОбработкаЗапускаПриложения", ЭтотОбъект);
	
	СтрокаЗапуска = СтрШаблон("""%1"" %2 %3 ""%4""",
		ОписаниеИБ.ПутьКФайлуКВерсииПлатформы,
		КлючЗапускаПредприятия(),
		КлючФайловойСтрокиПодключения(),
		ОписаниеИБ.ПутьКПапке
	);
	
	НачатьЗапускПриложения(ОписаниеОповещенияПослеЗапуска, СтрокаЗапуска, , Ложь);
КонецПроцедуры

Процедура ОткрытьКонфигураторФайловойБазы(ОписаниеИБ) Экспорт
	ОписаниеОповещенияПослеЗапуска = Новый ОписаниеОповещения("ОбработкаЗапускаПриложения", ЭтотОбъект);
	
	СтрокаЗапуска = СтрШаблон("""%1"" %2 %3 ""%4""",
		ОписаниеИБ.ПутьКФайлуКВерсииПлатформы,
		КлючЗапускаКонфигуратора(),
		КлючФайловойСтрокиПодключения(),
		ОписаниеИБ.ПутьКПапке
	);
	
	НачатьЗапускПриложения(ОписаниеОповещенияПослеЗапуска, СтрокаЗапуска, , Ложь);
КонецПроцедуры

Процедура ОткрытьПредприятиеСервернойБазы(ОписаниеИБ) Экспорт
	ОписаниеОповещенияПослеЗапуска = Новый ОписаниеОповещения("ОбработкаЗапускаПриложения", ЭтотОбъект);
	
	СтрокаЗапуска = СтрШаблон("""%1"" %2 %3 ""%4\%5""",
		ОписаниеИБ.ПутьКФайлуКВерсииПлатформы,
		КлючЗапускаПредприятия(),
		КлючСервернойСтрокиПодключения(),
		ОписаниеИБ.ИмяСервера,
		ОписаниеИБ.ИмяБазыНаСервере
	);
	
	НачатьЗапускПриложения(ОписаниеОповещенияПослеЗапуска, СтрокаЗапуска, , Ложь);
КонецПроцедуры

Процедура ОткрытьКонфигураторСервернойБазы(ОписаниеИБ) Экспорт
	ОписаниеОповещенияПослеЗапуска = Новый ОписаниеОповещения("ОбработкаЗапускаПриложения", ЭтотОбъект);
	
	СтрокаЗапуска = СтрШаблон("""%1"" %2 %3 ""%4\%5""",
		ОписаниеИБ.ПутьКФайлуКВерсииПлатформы,
		КлючЗапускаКонфигуратора(),
		КлючСервернойСтрокиПодключения(),
		ОписаниеИБ.ИмяСервера,
		ОписаниеИБ.ИмяБазыНаСервере
	);
	
	НачатьЗапускПриложения(ОписаниеОповещенияПослеЗапуска, СтрокаЗапуска, , Ложь);
КонецПроцедуры

Процедура ОткрытьПредприятиеВебСервернойБазы(ОписаниеИБ) Экспорт
	
КонецПроцедуры

Процедура ОткрытьКонфигураторВебСервернойБазы(ОписаниеИБ) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КлючЗапускаПредприятия()
	Возврат "ENTERPRISE";
КонецФункции

Функция КлючЗапускаКонфигуратора()
	Возврат "DESIGNER";
КонецФункции

Функция КлючФайловойСтрокиПодключения()
	Возврат "/F";
КонецФункции

Функция КлючСервернойСтрокиПодключения()
	Возврат "/S";
КонецФункции

Процедура ОбработкаЗапускаПриложения(КодВозврата, ДополнительныеПараметры = Неопределено) Экспорт
	
КонецПроцедуры

#КонецОбласти