#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ЗначениеЗаполнено(ЭтотОбъект.Родитель)
		И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Родитель, "ЭтоГруппа")
		Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создавать элемент на основании элемента (не группы)", , , , Отказ);
		Возврат;
	КонецЕсли;
	
	
	Если НЕ ЭтотОбъект.ЭтоНовый() Тогда
		ПредыдущийТип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка, "Тип");
		Если ПредыдущийТип = Перечисления.ТипыИнформационныхБаз.Файловая И ЭтотОбъект.Тип <> ПредыдущийТип Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ТипСмененСФайловойНаДругой", Истина);
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ПутьКУдаляемойПапке", ЭтотОбъект.ПутьКПапке);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.Тип = Перечисления.ТипыИнформационныхБаз.Файловая Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПутьКПапке) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен путь к папке ИБ", ЭтотОбъект, "ПутьКПапке", "ПутьКПапке", Отказ);
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ЭтотОбъект.Сервер = Неопределено;
			ЭтотОбъект.ИмяБазыНаСервере = Неопределено;
			ЭтотОбъект.АдресВебСервера = Неопределено;
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.Тип = Перечисления.ТипыИнформационныхБаз.Серверная Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Сервер) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено имя сервера ИБ", ЭтотОбъект, "Сервер", "Сервер", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ИмяБазыНаСервере) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено имя базы на сервере", ЭтотОбъект, "ИмяБазыНаСервере", "ИмяБазыНаСервере", Отказ);
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ЭтотОбъект.ПутьКПапке = Неопределено;
			ЭтотОбъект.АдресВебСервера = Неопределено;
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.Тип = Перечисления.ТипыИнформационныхБаз.ВебСерверная Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.АдресВебСервера) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен адрес веб-сервера", ЭтотОбъект, "АдресВебСервера", "АдресВебСервера", Отказ);
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ЭтотОбъект.ПутьКПапке = Неопределено;
			ЭтотОбъект.Сервер = Неопределено;
			ЭтотОбъект.ИмяБазыНаСервере = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоЗаписьНового", Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Идентификатор) Тогда
		ЭтотОбъект.Идентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Тип) Тогда
		ЭтотОбъект.Тип = ПредопределенноеЗначение("Перечисление.ТипыИнформационныхБаз.Файловая");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЭтотОбъект.Тип = Перечисления.ТипыИнформационныхБаз.Файловая Тогда
		ПроверяемыеРеквизиты.Добавить("ПутьКПапке");
		
	ИначеЕсли ЭтотОбъект.Тип = Перечисления.ТипыИнформационныхБаз.Серверная Тогда
		ПроверяемыеРеквизиты.Добавить("Сервер");
		ПроверяемыеРеквизиты.Добавить("ИмяБазыНаСервере");
		
	ИначеЕсли ЭтотОбъект.Тип = Перечисления.ТипыИнформационныхБаз.ВебСерверная Тогда
		ПроверяемыеРеквизиты.Добавить("АдресВебСервера");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти