#Область ПрограммныйИнтерфейс

Функция СеансСКонфигуратором(ОписаниеИБ) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Истина);
	Результат.Вставить("Сеанс");
	
	Компонента = COMСоединитель(ОписаниеИБ.ВерсияПрограммы);
	Если Компонента = Неопределено Тогда
		Результат.Успешно = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	Соединение = СоединениеСАгентомСервера(Компонента, ОписаниеИБ.АдресСервера, ОписаниеИБ.ПортАгентаСервера);
	Если Соединение = Неопределено Тогда
		Результат.Успешно = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	Кластер = ПолучитьКластер(
		Соединение,
		ОписаниеИБ.ПортКластера,
		ОписаниеИБ.ИмяАдминистратораКластера,
		ОписаниеИБ.ПарольАдминистратораКластера
	);
	Если Кластер = Неопределено Тогда
		Результат.Успешно = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	ИнформационнаяБаза = НайтиИнформационнуюБазуКластера(Соединение, Кластер, ОписаниеИБ.ИмяБазыВКластере);
	Если ИнформационнаяБаза = Неопределено Тогда
		Результат.Успешно = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	Сеансы = ПолучитьСеансы(Соединение, Кластер, ИнформационнаяБаза, Истина);
	Если Сеансы.Количество() = 0 Тогда
		Результат.Успешно = Истина;
		Возврат Результат;
	КонецЕсли;
	
	СеансСКонфигуратором = НайтиСеансСКонфигуратором(Сеансы);
	
	Результат.Сеанс = СеансСКонфигуратором;
	Возврат Результат;
КонецФункции

Функция ПроверитьСоединение(АдресСервера, ПортАгентаСервера, ВерсияПрограммы) Экспорт
	Компонента = COMСоединитель(ВерсияПрограммы);
	
	Если Компонента = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Соединение = СоединениеСАгентомСервера(Компонента, АдресСервера, ПортАгентаСервера);
	Возврат Соединение <> Неопределено;
КонецФункции

// Возвращает соответствие имен свойств сеансов информационной базы для структур, используемых в API и
//  объектов объектной модели COM-администратора.
//
// Возвращаемое значение: ФиксированнаяСтруктура:
//  Ключ - Строка, имя свойства в API (см. АдминистрированиеКластераКлиентСервер.СвойстваСеанса()),
//  Значение - Строка, имя свойства объекта.
//
Функция СловарьСвойствСеансов() Экспорт
	
	Результат = Новый Структура();
	
	Результат.Вставить("Номер", "SessionID");
	Результат.Вставить("ИмяПользователя", "UserName");
	Результат.Вставить("ИмяКлиентскогоКомпьютера", "Host");
	Результат.Вставить("ИдентификаторКлиентскогоПриложения", "AppID");
	Результат.Вставить("ИдентификаторЯзыка", "Locale");
	Результат.Вставить("МоментСозданияСеанса", "StartedAt");
	Результат.Вставить("МоментПоследнейАктивностиСеанса", "LastActiveAt");
	Результат.Вставить("БлокировкаСУБД", "blockedByDBMS");
	Результат.Вставить("Блокировка", "blockedByLS");
	Результат.Вставить("Передано", "bytesAll");
	Результат.Вставить("ПереданоЗа5Минут", "bytesLast5Min");
	Результат.Вставить("СерверныхВызовов", "callsAll");
	Результат.Вставить("СерверныхВызововЗа5Минут", "callsLast5Min");
	Результат.Вставить("ДлительностьСерверныхВызовов", "durationAll");
	Результат.Вставить("ДлительностьТекущегоСерверногоВызова", "durationCurrent");
	Результат.Вставить("ДлительностьСерверныхВызововЗа5Минут", "durationLast5Min");
	Результат.Вставить("ПереданоСУБД", "dbmsBytesAll");
	Результат.Вставить("ПереданоСУБДЗа5Минут", "dbmsBytesLast5Min");
	Результат.Вставить("ДлительностьВызововСУБД", "durationAllDBMS");
	Результат.Вставить("ДлительностьТекущегоВызоваСУБД", "durationCurrentDBMS");
	Результат.Вставить("ДлительностьВызововСУБДЗа5Минут", "durationLast5MinDBMS");
	Результат.Вставить("СоединениеСУБД", "dbProcInfo");
	Результат.Вставить("ВремяСоединенияСУБД", "dbProcTook");
	Результат.Вставить("МоментЗахватаСоединенияСУБД", "dbProcTookAt");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает COM-объект V8*.ComConnector (см. ИмяCOMСоединителя())
//
// Возвращаемое значение:
//  COMОбъект.
//
Функция COMСоединитель(ВерсияПрограммы)
	Попытка
		Возврат Новый COMОбъект(ИмяCOMСоединителя(ВерсияПрограммы));
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция ИмяCOMСоединителя(ВерсияПрограммы) Экспорт
	Возврат "V" + ВерсияПрограммы + ".COMConnector";
КонецФункции

Функция СоединениеСАгентомСервера(Знач COMСоединитель, Знач АдресАгентаСервера, Знач ПортАгентаСервера)
	СтрокаСоединенияСАгентомСервера = "tcp://" + АдресАгентаСервера + ":" + Формат(ПортАгентаСервера, "ЧГ=0");
	
	Попытка
		Возврат COMСоединитель.ConnectAgent(СтрокаСоединенияСАгентомСервера);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция ПолучитьКластер(Знач СоединениеСАгентомСервера, Знач ПортКластера, Знач ИмяАдминистратораКластера, Знач ПарольАдминистратораКластера)
	Для Каждого Кластер Из СоединениеСАгентомСервера.GetClusters() Цикл
		Если Кластер.MainPort = ПортКластера Тогда
			СоединениеСАгентомСервера.Authenticate(Кластер, ИмяАдминистратораКластера, ПарольАдминистратораКластера);
			Возврат Кластер;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

Функция НайтиИнформационнуюБазуКластера(Знач СоединениеСАгентомСервера, Знач Кластер, ИмяБазыВКластере)
	Для Каждого ОписаниеИнформационнойБазы Из СоединениеСАгентомСервера.GetInfoBases(Кластер) Цикл
		Если ОписаниеИнформационнойБазы.Name = ИмяБазыВКластере Тогда
			Возврат ОписаниеИнформационнойБазы;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

Функция ПолучитьСеансы(СоединениеСАгентомСервера, Кластер, ИнформационнаяБаза, Знач Описания = Ложь)
	Сеансы = Новый Массив;
	Словарь = СловарьСвойствСеансов();
	Для Каждого Сеанс Из СоединениеСАгентомСервера.GetInfoBaseSessions(Кластер, ИнформационнаяБаза) Цикл
		ОписаниеСеанса = ОписаниеОбъектаОбъектнойМоделиCOMАдминистратора(Сеанс, Словарь);
		
		Если Описания Тогда
			Сеансы.Добавить(ОписаниеСеанса);
		Иначе
			Сеансы.Добавить(Сеанс);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Сеансы;
КонецФункции

// Формирует описание для объекта объектной модели COM-администратора.
//
// Параметры:
//  Объект - COMОбъект,
//  Словарь - Соответствие, содержит соответствие свойств объекта и в описании:
//    Ключ - Имя свойства в описании,
//    Значение - Имя свойства объекта.
//
// Возвращаемое значение: Структура, описание объекта объектной модели COM-администратора
//  по переданному словарю.
//
Функция ОписаниеОбъектаОбъектнойМоделиCOMАдминистратора(Знач Объект, Знач Словарь)
	
	Описание = Новый Структура();
	Для Каждого ФрагментСловаря Из Словарь Цикл
		Если ЗначениеЗаполнено(Объект[ФрагментСловаря.Значение]) Тогда
			Описание.Вставить(ФрагментСловаря.Ключ, Объект[ФрагментСловаря.Значение]);
		Иначе
			Описание.Вставить(ФрагментСловаря.Ключ, Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Описание;
	
КонецФункции

Функция НайтиСеансСКонфигуратором(Сеансы)
	Для Каждого Сеанс Из Сеансы Цикл
		Если Сеанс.ИдентификаторКлиентскогоПриложения = ИдентификаторПриложенияСеансаКонфигуратор() Тогда
			Возврат Сеанс;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

Функция ИдентификаторПриложенияСеансаКонфигуратор()
	Возврат "Designer";
КонецФункции

#КонецОбласти