#Область ПрограммныйИнтерфейс

//Функция ОписаниеФайловойИБ() Экспорт
//	Описание = Новый Структура;
//	
//	ДобавитьОбщиеСвойстваОписанияИБ(Описание);
//	
//	Описание.Вставить("Заголовок", Неопределено);
//	Описание.Вставить("ПутьКПапке", Неопределено);
//	
//	Возврат Описание;
//КонецФункции

//Функция ОписаниеСервернойИБ() Экспорт
//	Описание = Новый Структура;
//	
//	ДобавитьОбщиеСвойстваОписанияИБ(Описание);
//	
//	Описание.Вставить("Заголовок", Неопределено);
//	Описание.Вставить("ИмяСервера", Неопределено);
//	Описание.Вставить("ИмяБазыНаСервере", Неопределено);
//	
//	Возврат Описание;
//КонецФункции

//Функция ОписаниеВебСервернойИБ() Экспорт
//	Описание = Новый Структура;
//	
//	ДобавитьОбщиеСвойстваОписанияИБ(Описание);
//	
//	Описание.Вставить("Заголовок", Неопределено);
//	Описание.Вставить("АдресВебСервера", Неопределено);
//	
//	Возврат Описание;
//КонецФункции

Функция ОписаниеЗапускаемойФайловойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияЗапускаемойИБ(Описание);
	
	Описание.Вставить("Заголовок", Неопределено);
	Описание.Вставить("ПутьКПапке", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция ОписаниеЗапускаемойСервернойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияЗапускаемойИБ(Описание);
	
	Описание.Вставить("Заголовок", Неопределено);
	Описание.Вставить("ИмяСервера", Неопределено);
	Описание.Вставить("ИмяБазыНаСервере", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция ОписаниеЗапускаемойВебСервернойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияЗапускаемойИБ(Описание);
	
	Описание.Вставить("Заголовок", Неопределено);
	Описание.Вставить("АдресВебСервера", Неопределено);
	
	Возврат Описание;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Процедура ДобавитьОбщиеСвойстваОписанияИБ(Описание)
//	Описание.Вставить("Группа", Неопределено);
//	Описание.Вставить("ПредупреждатьПередОткрытиемПредприятия", Ложь);
//	Описание.Вставить("ЗапретитьОткрыватьКонфигуратор", Ложь);
//	Описание.Вставить("СкоростьСоединения", Перечисления.СкоростьСоединения.Нормальная);
//	Описание.Вставить("ВерсияПлатформы", Неопределено);
//КонецПроцедуры

Процедура ДобавитьОбщиеСвойстваОписанияЗапускаемойИБ(Описание)
	Описание.Вставить("ПредупреждатьПередОткрытиемПредприятия", Ложь);
	Описание.Вставить("ЗапретитьОткрыватьКонфигуратор", Ложь);
	Описание.Вставить("СкоростьСоединения", Неопределено);
	Описание.Вставить("ПутьКФайлуКВерсииПлатформы", Неопределено);
КонецПроцедуры

#КонецОбласти