#Область ПрограммныйИнтерфейс

Функция ОписаниеЗапускаемойФайловойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияЗапускаемойИБ(Описание);
	
	Описание.Вставить("ПутьКПапке", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция ОписаниеЗапускаемойСервернойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияЗапускаемойИБ(Описание);
	
	Описание.Вставить("ИмяСервера", Неопределено);
	Описание.Вставить("ИмяБазыНаСервере", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция ОписаниеЗапускаемойВебСервернойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияЗапускаемойИБ(Описание);
	
	Описание.Вставить("АдресВебСервера", Неопределено);
	
	Возврат Описание;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьОбщиеСвойстваОписанияЗапускаемойИБ(Описание)
	Описание.Вставить("Заголовок", Неопределено);
	Описание.Вставить("ПредупреждатьПередОткрытиемПредприятия", Ложь);
	Описание.Вставить("ЗапретитьОткрыватьКонфигуратор", Ложь);
	Описание.Вставить("СкоростьСоединения", Неопределено);
	Описание.Вставить("ПутьКФайлуКВерсииПлатформы", Неопределено);
КонецПроцедуры

#КонецОбласти