#Область ПрограммныйИнтерфейс

Функция ОписаниеЗапускаемойФайловойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияЗапускаемойИБ(Описание);
	
	Описание.Вставить("ПутьКПапке", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция ОписаниеЗапускаемойСервернойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияЗапускаемойИБ(Описание);
	
	Описание.Вставить("ИмяСервера", Неопределено);
	Описание.Вставить("ИмяБазыНаСервере", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция ОписаниеЗапускаемойВебСервернойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияЗапускаемойИБ(Описание);
	
	Описание.Вставить("АдресВебСервера", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция ОписаниеУдаляемойГруппы() Экспорт
	Описание = Новый Структура;
	Описание.Вставить("Ссылка", Неопределено);
	Описание.Вставить("Заголовок", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция ОписаниеУдаляемойФайловойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияУдаляемойИБ(Описание);
	
	Описание.Вставить("ПутьКПапке", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция ОписаниеУдаляемойСервернойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияУдаляемойИБ(Описание);
	
	Описание.Вставить("ИмяСервера", Неопределено);
	Описание.Вставить("ИмяБазыНаСервере", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция ОписаниеУдаляемойВебСервернойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияУдаляемойИБ(Описание);
	
	Описание.Вставить("АдресВебСервера", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция ТипДобавленияНоваяИБ() Экспорт
	Возврат 1;
КонецФункции

Функция ТипДобавленияСуществующаяИБ() Экспорт
	Возврат 2;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьОбщиеСвойстваОписанияЗапускаемойИБ(Описание)
	Описание.Вставить("Ссылка", Неопределено);
	Описание.Вставить("Заголовок", Неопределено);
	Описание.Вставить("ПредупреждатьПередОткрытиемПредприятия", Ложь);
	Описание.Вставить("ЗапретитьОткрыватьКонфигуратор", Ложь);
	Описание.Вставить("СкоростьСоединения", Неопределено);
	Описание.Вставить("ПутьКПапкеКВерсииПлатформы", Неопределено);
	Описание.Вставить("Логин", Неопределено);
	Описание.Вставить("Пароль", Неопределено);
КонецПроцедуры

Процедура ДобавитьОбщиеСвойстваОписанияУдаляемойИБ(Описание)
	Описание.Вставить("Ссылка", Неопределено);
	Описание.Вставить("Заголовок", Неопределено);
	Описание.Вставить("ПутьКПапкеКВерсииПлатформы", Неопределено);
КонецПроцедуры

#КонецОбласти