#Область ПрограммныйИнтерфейс

Процедура ОткрытьПредприятиеФайловойБазы(ОписаниеИБ) Экспорт
	ОписаниеОповещенияПослеЗапуска = Новый ОписаниеОповещения("ОбработкаЗапускаПриложения", ЭтотОбъект);
	
	СтрокаЗапуска = СтрШаблон("""%1"" %2 %3 ""%4""",
		ОписаниеИБ.ПутьКФайлуКВерсииПлатформы,
		КлючЗапускаПредприятия(),
		КлючФайловойСтрокиПодключения(),
		ОписаниеИБ.ПутьКПапке
	);
	
	НачатьЗапускПриложения(ОписаниеОповещенияПослеЗапуска, СтрокаЗапуска, , Ложь);
КонецПроцедуры

Процедура ОткрытьКонфигураторФайловойБазы(ОписаниеИБ) Экспорт
	ОписаниеОповещенияПослеЗапуска = Новый ОписаниеОповещения("ОбработкаЗапускаПриложения", ЭтотОбъект);
	
	СтрокаЗапуска = СтрШаблон("""%1"" %2 %3 ""%4""",
		ОписаниеИБ.ПутьКФайлуКВерсииПлатформы,
		КлючЗапускаКонфигуратора(),
		КлючФайловойСтрокиПодключения(),
		ОписаниеИБ.ПутьКПапке
	);
	
	НачатьЗапускПриложения(ОписаниеОповещенияПослеЗапуска, СтрокаЗапуска, , Ложь);
КонецПроцедуры

Процедура ОткрытьПредприятиеСервернойБазы(ОписаниеИБ) Экспорт
	ОписаниеОповещенияПослеЗапуска = Новый ОписаниеОповещения("ОбработкаЗапускаПриложения", ЭтотОбъект);
	
	СтрокаЗапуска = СтрШаблон("""%1"" %2 %3 ""%4\%5""",
		ОписаниеИБ.ПутьКФайлуКВерсииПлатформы,
		КлючЗапускаПредприятия(),
		КлючСервернойСтрокиПодключения(),
		ОписаниеИБ.ИмяСервера,
		ОписаниеИБ.ИмяБазыНаСервере
	);
	
	НачатьЗапускПриложения(ОписаниеОповещенияПослеЗапуска, СтрокаЗапуска, , Ложь);
КонецПроцедуры

Процедура ОткрытьКонфигураторСервернойБазы(ОписаниеИБ) Экспорт
	ОписаниеОповещенияПослеЗапуска = Новый ОписаниеОповещения("ОбработкаЗапускаПриложения", ЭтотОбъект);
	
	СтрокаЗапуска = СтрШаблон("""%1"" %2 %3 ""%4\%5""",
		ОписаниеИБ.ПутьКФайлуКВерсииПлатформы,
		КлючЗапускаКонфигуратора(),
		КлючСервернойСтрокиПодключения(),
		ОписаниеИБ.ИмяСервера,
		ОписаниеИБ.ИмяБазыНаСервере
	);
	
	НачатьЗапускПриложения(ОписаниеОповещенияПослеЗапуска, СтрокаЗапуска, , Ложь);
КонецПроцедуры

Процедура ОткрытьПредприятиеВебСервернойБазы(ОписаниеИБ) Экспорт
	ОписаниеОповещенияПослеЗапуска = Новый ОписаниеОповещения("ОбработкаЗапускаПриложения", ЭтотОбъект);
	
	СтрокаЗапуска = СтрШаблон("""%1"" %2 %3 ""%4""",
		ОписаниеИБ.ПутьКФайлуКВерсииПлатформы,
		КлючЗапускаПредприятия(),
		КлючВебСервернойСтрокиПодключения(),
		ОписаниеИБ.АдресВебСервера
	);
	
	НачатьЗапускПриложения(ОписаниеОповещенияПослеЗапуска, СтрокаЗапуска, , Ложь);
КонецПроцедуры

Процедура ОткрытьКонфигураторВебСервернойБазы(ОписаниеИБ) Экспорт
	ОписаниеОповещенияПослеЗапуска = Новый ОписаниеОповещения("ОбработкаЗапускаПриложения", ЭтотОбъект);
	
	СтрокаЗапуска = СтрШаблон("""%1"" %2 %3 ""%4""",
		ОписаниеИБ.ПутьКФайлуКВерсииПлатформы,
		КлючЗапускаКонфигуратора(),
		КлючВебСервернойСтрокиПодключения(),
		ОписаниеИБ.АдресВебСервера
	);
	
	НачатьЗапускПриложения(ОписаниеОповещенияПослеЗапуска, СтрокаЗапуска, , Ложь);
КонецПроцедуры

Процедура УдалитьКэшФайловойИБ(ОписаниеИБ) Экспорт
	ОписаниеОповещенияПослеЗапуска = Новый ОписаниеОповещения("ОбработкаЗапускаКомандыУдаленияКэша", ЭтотОбъект);
	
	СтрокаЗапуска = СтрШаблон("""%1"" %2 %3 ""%4"" %5",
		ОписаниеИБ.ПутьКФайлуКВерсииПлатформы,
		КлючЗапускаПредприятия(),
		КлючФайловойСтрокиПодключения(),
		ОписаниеИБ.ПутьКПапке,
		КлючОчисткиКэша()
	);
	
	НачатьЗапускПриложения(ОписаниеОповещенияПослеЗапуска, СтрокаЗапуска, , Ложь);
КонецПроцедуры

Процедура УдалитьКэшСервернойИБ(ОписаниеИБ) Экспорт
	ОписаниеОповещенияПослеЗапуска = Новый ОписаниеОповещения("ОбработкаЗапускаКомандыУдаленияКэша", ЭтотОбъект);
	
	СтрокаЗапуска = СтрШаблон("""%1"" %2 %3 ""%4\%5"" %6",
		ОписаниеИБ.ПутьКФайлуКВерсииПлатформы,
		КлючЗапускаПредприятия(),
		КлючСервернойСтрокиПодключения(),
		ОписаниеИБ.ИмяСервера,
		ОписаниеИБ.ИмяБазыНаСервере,
		КлючОчисткиКэша()
	);
	
	НачатьЗапускПриложения(ОписаниеОповещенияПослеЗапуска, СтрокаЗапуска, , Ложь);
КонецПроцедуры

Процедура УдалитьКэшВебСервернойИБ(ОписаниеИБ) Экспорт
	ОписаниеОповещенияПослеЗапуска = Новый ОписаниеОповещения("ОбработкаЗапускаКомандыУдаленияКэша", ЭтотОбъект);
	
	СтрокаЗапуска = СтрШаблон("""%1"" %2 %3 ""%4"" %5",
		ОписаниеИБ.ПутьКФайлуКВерсииПлатформы,
		КлючЗапускаПредприятия(),
		КлючВебСервернойСтрокиПодключения(),
		ОписаниеИБ.АдресВебСервера,
		КлючОчисткиКэша()
	);
	
	НачатьЗапускПриложения(ОписаниеОповещенияПослеЗапуска, СтрокаЗапуска, , Ложь);
КонецПроцедуры

Процедура СоздатьНовуюФайловуюБазу(ОписаниеИБ) Экспорт
	ОписаниеОповещенияПослеЗапуска = Новый ОписаниеОповещения("ОбработкаЗапускаКомандыСозданияФайловойИБ", ЭтотОбъект);
	
	СтрокаЗапуска = СтрШаблон("""%1"" %2 %3=""%4""",
		ОписаниеИБ.ПутьКФайлуКВерсииПлатформы,
		КлючСозданияИБ(),
		КлючФайловойСоздаваемойБазы(),
		ОписаниеИБ.ПутьКПапке
	);
	
	НачатьЗапускПриложения(ОписаниеОповещенияПослеЗапуска, СтрокаЗапуска, , Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КлючЗапускаПредприятия()
	Возврат "ENTERPRISE";
КонецФункции

Функция КлючЗапускаКонфигуратора()
	Возврат "DESIGNER";
КонецФункции

Функция КлючФайловойСтрокиПодключения()
	Возврат "/F";
КонецФункции

Функция КлючСервернойСтрокиПодключения()
	Возврат "/S";
КонецФункции

Функция КлючВебСервернойСтрокиПодключения()
	Возврат "/WS";
КонецФункции

Функция КлючОчисткиКэша()
	Возврат "/ClearCache";
КонецФункции

#Область Создание

Функция КлючСозданияИБ()
	Возврат "CREATEINFOBASE";
КонецФункции

Функция КлючФайловойСоздаваемойБазы()
	Возврат "File";
КонецФункции

#КонецОбласти

Процедура ОбработкаЗапускаПриложения(КодВозврата, ДополнительныеПараметры = Неопределено) Экспорт
	
КонецПроцедуры

Процедура ОбработкаЗапускаКомандыУдаленияКэша(КодВозврата, ДополнительныеПараметры = Неопределено) Экспорт
	
КонецПроцедуры

Процедура ОбработкаЗапускаКомандыСозданияФайловойИБ(КодВозврата, ДополнительныеПараметры = Неопределено) Экспорт
	
КонецПроцедуры

#КонецОбласти