#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ТипДобавления", ЭтотОбъект.ТипДобавления);
	
	Если ЭтотОбъект.ТипДобавления = ИнформационныеБазыКлиентСервер.ТипДобавленияНоваяИБ() Тогда
		Элементы.Тип.СписокВыбора.Очистить();
		
		Элементы.Тип.СписокВыбора.Добавить(Перечисления.ТипыИнформационныхБаз.Файловая);
	КонецЕсли;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ЭтотОбъект.УчетныеДанные.Параметры.УстановитьЗначениеПараметра("ЭтаИнформационнаяБаза", Объект.Ссылка);
		
		ИнформационныеБазы.УстановитьНадписьСеансаСКонфигуратором(ЭтотОбъект, Объект.Ссылка);
	КонецЕсли;
	
	УстановитьПризнакНаличияОбязательныхФайлов();
	
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПерепроверитьИнформационнуюБазу", 5);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЭтоЗаписьНового = ТекущийОбъект.ДополнительныеСвойства.Свойство("ЭтоЗаписьНового")
		И ТекущийОбъект.ДополнительныеСвойства.ЭтоЗаписьНового;
	
	Если ЭтотОбъект.ТипДобавления = ИнформационныеБазыКлиентСервер.ТипДобавленияНоваяИБ()
		И ЭтоЗаписьНового
		Тогда
		ПараметрыЗаписи.Вставить("ЭтоЗаписьНового", ТекущийОбъект.ДополнительныеСвойства.ЭтоЗаписьНового);
		ПараметрыЗаписи.Вставить("ПутьКПапкеКВерсииПлатформы", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВерсияПлатформы, "ПутьКПапке"));
		
		Элементы.Тип.СписокВыбора.Очистить();
		
		Элементы.Тип.СписокВыбора.Добавить(Перечисления.ТипыИнформационныхБаз.Файловая);
		Элементы.Тип.СписокВыбора.Добавить(Перечисления.ТипыИнформационныхБаз.Серверная);
		Элементы.Тип.СписокВыбора.Добавить(Перечисления.ТипыИнформационныхБаз.ВебСерверная);
	КонецЕсли;
	
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ТипСмененСФайловойНаДругой")
		И ТекущийОбъект.ДополнительныеСвойства.ТипСмененСФайловойНаДругой
		Тогда
		ПараметрыЗаписи.Вставить("ТипСмененСФайловойНаДругой", Истина);
		ПараметрыЗаписи.Вставить("ПутьКУдаляемойПапке", ТекущийОбъект.ДополнительныеСвойства.ПутьКУдаляемойПапке);
	КонецЕсли;
	
	Если ЭтоЗаписьНового Тогда
		ЭтотОбъект.УчетныеДанные.Параметры.УстановитьЗначениеПараметра("ЭтаИнформационнаяБаза", Объект.Ссылка);
	КонецЕсли;
	
	ИзменитьОтображениеЭлементовФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если ЭтотОбъект.ТипДобавления = ИнформационныеБазыКлиентСервер.ТипДобавленияНоваяИБ()
		И ПараметрыЗаписи.Свойство("ЭтоЗаписьНового")
		И ПараметрыЗаписи.ЭтоЗаписьНового
		Тогда
		ОписаниеИБ = Новый Структура;
		ОписаниеИБ.Вставить("ПутьКПапкеКВерсииПлатформы", ПараметрыЗаписи.ПутьКПапкеКВерсииПлатформы);
		ОписаниеИБ.Вставить("ПутьКПапке", Объект.ПутьКПапке);
		
		ПлатформаКлиент.СоздатьНовуюФайловуюБазу(ОписаниеИБ);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ТипСмененСФайловойНаДругой")
		И ПараметрыЗаписи.ТипСмененСФайловойНаДругой
		Тогда
		ИнформационныеБазыКлиент.УдалитьПапкуФайловойБазы(ПараметрыЗаписи.ПутьКУдаляемойПапке);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Закрыть(?(Объект.Ссылка.Пустая(), Неопределено, Объект.Ссылка));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждатьПередОткрытиемПредприятияПриИзменении(Элемент)
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьОткрыватьКонфигураторПриИзменении(Элемент)
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКПапкеПриИзменении(Элемент)
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура СерверПриИзменении(Элемент)
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИмяБазыНаСервереПриИзменении(Элемент)
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура АдресВебСервераПриИзменении(Элемент)
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПлатформыПриИзменении(Элемент)
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	ТипПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПутьКПапкеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите файл стандартного списка";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = Объект.ПутьКПапке;
	
	ВыбранныеФайлы = Ждать Диалог.ВыбратьАсинх();
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		Объект.ПутьКПапке = ВыбранныеФайлы[0];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчетныеДанныеПоУмолчаниюПриИзменении(Элемент)
	УчетныеДанныеПоУмолчаниюПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьУчетныеДанныеПоУмолчанию(Команда)
	Если Элементы.УчетныеДанные.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.УчетныеДанныеПоУмолчанию = Элементы.УчетныеДанные.ТекущаяСтрока;
	ЭтотОбъект.Модифицированность = Истина;
	
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонфигурацию(Команда)
	ИнформационныеБазыКлиент.ОбработатьОткрытиеКонфигуратор(Объект.Ссылка);
	
	ОткрытьКонфигурациюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОткрытьКонфигурациюНаСервере()
	ИнформационныеБазы.УстановитьНадписьСеансаСКонфигуратором(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПредприятие(Команда)
	ИнформационныеБазыКлиент.ОбработатьОткрытиеПредприятия(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеСтатусаСеансаСКонфигураторомНаСервере()
	ИнформационныеБазы.УстановитьНадписьСеансаСКонфигуратором(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеСтатусаСеансаСКонфигуратором(Команда)
	ОбновитьОтображениеСтатусаСеансаСКонфигураторомНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьОтображениеЭлементовФормы(ЭтоПослеЗаписи = Ложь)
	ЭтоФайловая = Объект.Тип = Перечисления.ТипыИнформационныхБаз.Файловая;
	ЭтоСерверная = Объект.Тип = Перечисления.ТипыИнформационныхБаз.Серверная;
	ЭтоВебСерверная = Объект.Тип = Перечисления.ТипыИнформационныхБаз.ВебСерверная;
	
	Элементы.ПутьКПапке.Видимость = ЭтоФайловая;
	
	Элементы.Сервер.Видимость = ЭтоСерверная;
	Элементы.ИмяБазыНаСервере.Видимость = ЭтоСерверная;
	
	Элементы.АдресВебСервера.Видимость = ЭтоВебСерверная;
	
	ЭтоНовыйОбъект = Объект.Ссылка.Пустая();
	
	Элементы.СтраницаУчетныеДанные.Доступность = НЕ ЭтоНовыйОбъект;
	
	Элементы.ГруппаНетОбязательныхФайлов.Видимость = НЕ ЭтотОбъект.ЕстьФайлыВПапке;
	
	РазрешитьЗапуск = НЕ (ЭтоНовыйОбъект ИЛИ НЕ ЭтоПослеЗаписи И ЭтотОбъект.Модифицированность)
		И ЭтотОбъект.ЕстьФайлыВПапке;
	Элементы.ФормаПодменюКонфигуратор.Доступность = РазрешитьЗапуск;
	Элементы.ФормаОткрытьПредприятие.Доступность = РазрешитьЗапуск;
КонецПроцедуры

&НаСервере
Процедура ТипПриИзмененииНаСервере()
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура УчетныеДанныеПоУмолчаниюПриИзмененииНаСервере()
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПерепроверитьИнформационнуюБазу()
	ПерепроверитьИнформационнуюБазуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПерепроверитьИнформационнуюБазуНаСервере()
	УстановитьПризнакНаличияОбязательныхФайлов();
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакНаличияОбязательныхФайлов()
	ЭтотОбъект.ЕстьФайлыВПапке = Объект.Ссылка.Пустая()
		ИЛИ НЕ Объект.Ссылка.Пустая()
			И (Объект.Тип <> Перечисления.ТипыИнформационныхБаз.Файловая
				ИЛИ Объект.Тип = Перечисления.ТипыИнформационныхБаз.Файловая
					И ИнформационныеБазы.ЕстьНеобходимыеФайлыИБ(Объект.ПутьКПапке));
КонецПроцедуры

#КонецОбласти
