#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	ТипПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьОтображениеЭлементовФормы()
	ЭтоФайловая = Объект.Тип = Перечисления.ТипыИнформационныхБаз.Файловая;
	ЭтоСерверная = Объект.Тип = Перечисления.ТипыИнформационныхБаз.Серверная;
	ЭтоВебСерверная = Объект.Тип = Перечисления.ТипыИнформационныхБаз.ВебСерверная;
	
	Элементы.ПутьКПапке.Видимость = ЭтоФайловая;
	
	Элементы.ИмяСервера.Видимость = ЭтоСерверная;
	Элементы.ИмяБазыНаСервере.Видимость = ЭтоСерверная;
	
	Элементы.АдресВебСервера.Видимость = ЭтоВебСерверная;
КонецПроцедуры

&НаСервере
Процедура ТипПриИзмененииНаСервере()
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

#КонецОбласти
