#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ТипДобавления", ЭтотОбъект.ТипДобавления);
	
	Если ЭтотОбъект.ТипДобавления = ИнформационныеБазыКлиентСервер.ТипДобавленияНоваяИБ() Тогда
		Элементы.Тип.СписокВыбора.Очистить();
		
		Элементы.Тип.СписокВыбора.Добавить(Перечисления.ТипыИнформационныхБаз.Файловая);
	КонецЕсли;
	
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтотОбъект.ТипДобавления = ИнформационныеБазыКлиентСервер.ТипДобавленияНоваяИБ()
		И ТекущийОбъект.ДополнительныеСвойства.Свойство("ЭтоЗаписьНового")
		И ТекущийОбъект.ДополнительныеСвойства.ЭтоЗаписьНового
		Тогда
		ПараметрыЗаписи.Вставить("ЭтоЗаписьНового", ТекущийОбъект.ДополнительныеСвойства.ЭтоЗаписьНового);
		ПараметрыЗаписи.Вставить("ПутьКФайлуКВерсииПлатформы", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВерсияПлатформы, "ПутьКФайлу"));
		
		Элементы.Тип.СписокВыбора.Очистить();
		
		Элементы.Тип.СписокВыбора.Добавить(Перечисления.ТипыИнформационныхБаз.Файловая);
		Элементы.Тип.СписокВыбора.Добавить(Перечисления.ТипыИнформационныхБаз.Серверная);
		Элементы.Тип.СписокВыбора.Добавить(Перечисления.ТипыИнформационныхБаз.ВебСерверная);
	КонецЕсли;
	
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ТипСмененСФайловойНаДругой")
		И ТекущийОбъект.ДополнительныеСвойства.ТипСмененСФайловойНаДругой
		Тогда
		ПараметрыЗаписи.Вставить("ТипСмененСФайловойНаДругой", Истина);
		ПараметрыЗаписи.Вставить("ПутьКУдаляемойПапке", ТекущийОбъект.ДополнительныеСвойства.ПутьКУдаляемойПапке);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если ЭтотОбъект.ТипДобавления = ИнформационныеБазыКлиентСервер.ТипДобавленияНоваяИБ()
		И ПараметрыЗаписи.Свойство("ЭтоЗаписьНового")
		И ПараметрыЗаписи.ЭтоЗаписьНового
		Тогда
		ОписаниеИБ = Новый Структура;
		ОписаниеИБ.Вставить("ПутьКФайлуКВерсииПлатформы", ПараметрыЗаписи.ПутьКФайлуКВерсииПлатформы);
		ОписаниеИБ.Вставить("ПутьКПапке", Объект.ПутьКПапке);
		
		ПлатформаКлиент.СоздатьНовуюФайловуюБазу(ОписаниеИБ);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ТипСмененСФайловойНаДругой")
		И ПараметрыЗаписи.ТипСмененСФайловойНаДругой
		Тогда
		ИнформационныеБазыКлиент.УдалитьПапкуФайловойБазы(ПараметрыЗаписи.ПутьКУдаляемойПапке);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	ТипПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПутьКПапкеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите файл стандартного списка";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = Объект.ПутьКПапке;
	
	ВыбранныеФайлы = Ждать Диалог.ВыбратьАсинх();
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		Объект.ПутьКПапке = ВыбранныеФайлы[0];
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьОтображениеЭлементовФормы()
	ЭтоФайловая = Объект.Тип = Перечисления.ТипыИнформационныхБаз.Файловая;
	ЭтоСерверная = Объект.Тип = Перечисления.ТипыИнформационныхБаз.Серверная;
	ЭтоВебСерверная = Объект.Тип = Перечисления.ТипыИнформационныхБаз.ВебСерверная;
	
	Элементы.ПутьКПапке.Видимость = ЭтоФайловая;
	
	Элементы.ИмяСервера.Видимость = ЭтоСерверная;
	Элементы.ИмяБазыНаСервере.Видимость = ЭтоСерверная;
	
	Элементы.АдресВебСервера.Видимость = ЭтоВебСерверная;
КонецПроцедуры

&НаСервере
Процедура ТипПриИзмененииНаСервере()
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

#КонецОбласти
