#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	ТипПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПутьКПапкеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите файл стандартного списка";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = Объект.ПутьКПапке;
	
	ВыбранныеФайлы = Ждать Диалог.ВыбратьАсинх();
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		Объект.ПутьКПапке = ВыбранныеФайлы[0];
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьОтображениеЭлементовФормы()
	ЭтоФайловая = Объект.Тип = Перечисления.ТипыИнформационныхБаз.Файловая;
	ЭтоСерверная = Объект.Тип = Перечисления.ТипыИнформационныхБаз.Серверная;
	ЭтоВебСерверная = Объект.Тип = Перечисления.ТипыИнформационныхБаз.ВебСерверная;
	
	Элементы.ПутьКПапке.Видимость = ЭтоФайловая;
	
	Элементы.ИмяСервера.Видимость = ЭтоСерверная;
	Элементы.ИмяБазыНаСервере.Видимость = ЭтоСерверная;
	
	Элементы.АдресВебСервера.Видимость = ЭтоВебСерверная;
КонецПроцедуры

&НаСервере
Процедура ТипПриИзмененииНаСервере()
	ИзменитьОтображениеЭлементовФормы();
КонецПроцедуры

#КонецОбласти
