#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СохраняемыйНаборКонстант = РеквизитФормыВЗначение("НаборКонстант");
	СохраняемыйНаборКонстант.Прочитать();
	
	ЗначениеВРеквизитФормы(СохраняемыйНаборКонстант, "НаборКонстант");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЭтотОбъект.ДанныеСтраницыОсновнаяМодифицированы Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеВопросаОМодифицированности", ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения,
			"Данные на страницы ""Основные"" были изменены. Сохранить изменения?",
			РежимДиалогаВопрос.ДаНетОтмена, , 
			КодВозвратаДиалога.Да
		);
		
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура НаборКонстантПутьКФайлуСпискаИнформационныхБазНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл стандартного списка";
	Диалог.Фильтр = "Файл списка (*.v8i)|*.v8i";
	Диалог.МножественныйВыбор = Ложь;
	
	Если НЕ ПустаяСтрока(НаборКонстант.ПутьКФайлуСпискаИнформационныхБаз) Тогда
		Диалог.Каталог = ОбщегоНазначенияКлиентСервер.ПутьККаталогуФайла(НаборКонстант.ПутьКФайлуСпискаИнформационныхБаз);
	КонецЕсли;
	
	ВыбранныеФайлы = Ждать Диалог.ВыбратьАсинх();
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		НаборКонстант.ПутьКФайлуСпискаИнформационныхБаз = ВыбранныеФайлы[0];
		
		ЭтотОбъект.ДанныеСтраницыОсновнаяМодифицированы = Истина;
		УстановитьПризнакМодифицированностиУСтраницыОснованая();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантПутьКФайлуСпискаИнформационныхБазПриИзменении(Элемент)
	ЭтотОбъект.ДанныеСтраницыОсновнаяМодифицированы = Истина;
	УстановитьПризнакМодифицированностиУСтраницыОснованая();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКоманды

&НаКлиенте
Процедура Сохранить(Команда)
	Если ЭтотОбъект.Модифицированность Тогда
		СохранитьНаСервере();
		
		ЭтотОбъект.Модифицированность = Ложь;
		ЭтотОбъект.ДанныеСтраницыОсновнаяМодифицированы = Ложь;
		УстановитьПризнакМодифицированностиУСтраницыОснованая();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНаСервере()
	СохраняемыйНаборКонстант = РеквизитФормыВЗначение("НаборКонстант");
	СохраняемыйНаборКонстант.Записать();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПризнакМодифицированностиУСтраницыОснованая()
	ЗаголовокСтраницы = "Основные";
	
	Элементы.СтраницаОсновные.Заголовок = ?(ЭтотОбъект.ДанныеСтраницыОсновнаяМодифицированы,
		СтрШаблон("%1 (*)", ЗаголовокСтраницы),
		ЗаголовокСтраницы
	);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеВопросаОМодифицированности(Ответ, ДопПараметры = Неопределено) Экспорт
	Если Ответ = Неопределено ИЛИ Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.Модифицированность = Ложь;
	ЭтотОбъект.ДанныеСтраницыОсновнаяМодифицированы = Ложь;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СохранитьНаСервере();
	КонецЕсли;
	
	Закрыть();
КонецПроцедуры

#КонецОбласти