// @strict-types
#Область ПрограммныйИнтерфейс

// Читает файл списка информационных баз
// 
// Параметры:
//  ПутьКФайлу - Строка
//             - Неопределено - значение будет получено из ПутьКФайлуСпискаИнформационныхБаз
// 
// Возвращаемое значение:
//  Структура:
//      * ИнформационныеБазы - Массив из см. ОписаниеИнформационнойБазы
//      * Группы - Массив из см. ОписаниеГруппы
Функция ПрочитатьФайлСпискаИнформационныхБаз(ПутьКФайлу = Неопределено) Экспорт
	Если ПутьКФайлу = Неопределено Тогда
		ПутьКФайлу = ПутьКФайлуСпискаИнформационныхБаз();
	КонецЕсли;
	
	ЭлементыСписка = Новый Структура;
	ЭлементыСписка.Вставить("ИнформационныеБазы", Новый Массив);
	ЭлементыСписка.Вставить("Группы", Новый Массив);
	
	ПрочитанныеДанные = IniФайл.ПрочитатьТекстФайла(ПутьКФайлу);
	
	Для Каждого Данные Из ПрочитанныеДанные Цикл
		ЗаголовокЭлементаСписка = СокрЛП(Данные.Ключ);
		
		Если ПустаяСтрока(ЗаголовокЭлементаСписка) Тогда
			Продолжить;
		КонецЕсли;
		
		ПреобразованныйИдентификатор = ИдентификаторЭлементаСписка(Данные);
			
		Если ПреобразованныйИдентификатор = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСоединения = Данные.Значение.Получить(КлючСтрокиСоединения());
		
		ЭтоГруппа = СтрокаСоединения = Неопределено;
		
		//@skip-check invocation-parameter-type-intersect
		Если ЭтоГруппа Тогда
			ДанныеГруппы = ОписаниеГруппы();
			ДанныеГруппы.Идентификатор = ПреобразованныйИдентификатор;
			ДанныеГруппы.Заголовок = ЗаголовокЭлементаСписка;
			ДанныеГруппы.Папка = ПапкаЭлементаСписка(Данные);
			
			//@skip-check typed-value-adding-to-untyped-collection
			ЭлементыСписка.Группы.Добавить(ДанныеГруппы);
			
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЭтоСтрока(СтрокаСоединения) И ЭтоСтрокаСоединения(СтрокаСоединения) Тогда
			ДанныеИБ = ОписаниеИнформационнойБазы();
			ДанныеИБ.Идентификатор = ПреобразованныйИдентификатор;
			ДанныеИБ.Заголовок = ЗаголовокЭлементаСписка;
			ДанныеИБ.СтрокаПодключения = СтрокаСоединения;
			ДанныеИБ.Папка = ПапкаЭлементаСписка(Данные);
			ДанныеИБ.СкоростьСоединения = СкоростьСоединенияСИнформационнойБазой(Данные);
			ДанныеИБ.ВерсияПлатформы = ВерсияПлатформыИнформационнойБазы(Данные);
			
			//@skip-check typed-value-adding-to-untyped-collection
			ЭлементыСписка.ИнформационныеБазы.Добавить(ДанныеИБ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЭлементыСписка;
КонецФункции

Функция ПутьКФайлуСпискаИнформационныхБаз() Экспорт
	Возврат Константы.ПутьКФайлуСпискаИнформационныхБаз.Получить();
КонецФункции

// Возвращает описание элемента списка информационной базы
// 
// Возвращаемое значение:
//  Структура:
//      * Идентификатор - УникальныйИдентификатор
//      * Заголовок - Строка
//      * ПорядокВСписке - Число
//      * Папка - Строка
//      * СтрокаПодключения - Строка
//                          - Неопределено
//      * СкоростьСоединения - Строка - одно из значений см. НормальнаяСкоростьСоединенияСИнформационнойБазой
//                           - Неопределено
//      * ВерсияПлатформы - Строка
//                        - Неопределено
Функция ОписаниеИнформационнойБазы() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбязательныеСвойстваЭлементаСписка(Описание);
	
	Описание.Вставить("СтрокаПодключения", Неопределено);
	Описание.Вставить("СкоростьСоединения", Неопределено);
	Описание.Вставить("ВерсияПлатформы", Неопределено);
	
	//@skip-check constructor-function-return-section
	Возврат Описание;
КонецФункции

// Возвращает описание группы элементов списка
// 
// Возвращаемое значение:
//  Структура:
//      * Идентификатор - УникальныйИдентификатор
//      * Заголовок - Строка
//      * ПорядокВСписке - Число
//      * Папка - Строка
Функция ОписаниеГруппы() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбязательныеСвойстваЭлементаСписка(Описание);
	
	//@skip-check constructor-function-return-section
	Возврат Описание;
КонецФункции

// Возвращает разделитель папок в пути к элементу списка
// 
// Возвращаемое значение:
//  Строка
Функция РазделительПапок() Экспорт
	Возврат "/";
КонецФункции

// Возвращает имена (заголовки) папок элемента списка
// 
// Параметры:
//  Папки - Строка
// 
// Возвращаемое значение:
//  Массив из Строка - первый элемент - первый уровень вложенности и так далее
Функция ИменаПапокЭлементаСписка(Папки) Экспорт
	Возврат СтрРазделить(Папки, РазделительПапок(), Ложь);
КонецФункции

#Область КлючиПрочитанныхДанныхСекций

Функция КлючСтрокиСоединения() Экспорт
	Возврат "Connect";
КонецФункции

Функция КлючИдентификатора() Экспорт
	Возврат "ID";
КонецФункции

Функция КлючПапки() Экспорт
	Возврат "Folder";
КонецФункции

Функция КлючСкоростиСоединения() Экспорт
	Возврат "ClientConnectionSpeed";
КонецФункции

Функция КлючВерсииПлатформы() Экспорт
	Возврат "Version";
КонецФункции

#КонецОбласти

#Область СкоростьСоединенияСИнформационнойБазой

Функция ЭтоСкоростьСоединенияСИнформационнойБазой(ПроверяемоеЗначение) Экспорт
	Возврат ПроверяемоеЗначение = НормальнаяСкоростьСоединенияСИнформационнойБазой();
КонецФункции

Функция НормальнаяСкоростьСоединенияСИнформационнойБазой() Экспорт
	Возврат "Normal";
КонецФункции

#КонецОбласти

#Область СтрокаСоединения

Функция ПутьКПапкеФайловойИБ(СтрокаПодлючения) Экспорт
	КлючИЗначение = СтрРазделить(СтрокаПодлючения, РазделительКлючаИЗначенияСтрокиПодключения());
	
	Если КлючИЗначение.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПутьКПапке = КлючИЗначение[1];
	
	ЗаменяемыйСимвол = """";
	
	ПутьКПапке = Сред(ПутьКПапке, СтрНайти(ПутьКПапке, ЗаменяемыйСимвол) + 1);
	ПутьКПапке = Сред(ПутьКПапке, 1, СтрНайти(ПутьКПапке, ЗаменяемыйСимвол, НаправлениеПоиска.СКонца) - 1);
	
	Возврат ПутьКПапке;
КонецФункции

Функция СоставСтрокиПодключенияСервернойИБ(СтрокаПодключения) Экспорт
	ДанныеПодключения = Новый Структура;
	ДанныеПодключения.Вставить("ИмяСервера");
	ДанныеПодключения.Вставить("ИмяБазы");
	
	ШаблонИмениСервера = СтрШаблон("%1%2"".*""",
		КлючИмениСервераИнформационнойБазы(),
		РазделительКлючаИЗначенияСтрокиПодключения()
	);
	ЧастьИмениСервера = СтрНайтиПоРегулярномуВыражению(СтрокаПодключения, ШаблонИмениСервера);
	ЧастьИмениСервера = ЧастьИмениСервера.Значение;
	
	КлючИЗначение = СтрРазделить(ЧастьИмениСервера, РазделительКлючаИЗначенияСтрокиПодключения());
	Если КлючИЗначение.Количество() = 0 Тогда
		Возврат ДанныеПодключения;
	КонецЕсли;
	
	ИмяСервера = КлючИЗначение[1];
	
	ЗаменяемыйСимвол = """";
	
	ИмяСервера = Сред(ИмяСервера, СтрНайти(ИмяСервера, ЗаменяемыйСимвол) + 1);
	ИмяСервера = Сред(ИмяСервера, 1, СтрНайти(ИмяСервера, ЗаменяемыйСимвол, НаправлениеПоиска.СКонца) - 1);
	
	ДанныеПодключения.ИмяСервера = ИмяСервера;
	
	ШаблонИмениБазы = СтрШаблон("%1%2"".*""",
		КлючИмениИнформационнойБазыНаСервере(),
		РазделительКлючаИЗначенияСтрокиПодключения()
	);
	ЧастьИмениБазы = СтрНайтиПоРегулярномуВыражению(СтрокаПодключения, ШаблонИмениБазы);
	ЧастьИмениБазы = ЧастьИмениБазы.Значение;
	
	КлючИЗначение = СтрРазделить(ЧастьИмениБазы, РазделительКлючаИЗначенияСтрокиПодключения());
	Если КлючИЗначение.Количество() = 0 Тогда
		Возврат ДанныеПодключения;
	КонецЕсли;
	
	ИмяБазы = КлючИЗначение[1];
	
	ЗаменяемыйСимвол = """";
	
	ИмяБазы = Сред(ИмяБазы, СтрНайти(ИмяБазы, ЗаменяемыйСимвол) + 1);
	ИмяБазы = Сред(ИмяБазы, 1, СтрНайти(ИмяБазы, ЗаменяемыйСимвол, НаправлениеПоиска.СКонца) - 1);
	
	ДанныеПодключения.ИмяБазы = ИмяБазы;
	
	Возврат ДанныеПодключения;
КонецФункции

Функция АдресВебСервенойИБ(СтрокаПодлючения) Экспорт
	КлючИЗначение = СтрРазделить(СтрокаПодлючения, РазделительКлючаИЗначенияСтрокиПодключения());
	
	Если КлючИЗначение.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	АдресВебСервер = КлючИЗначение[1];
	
	ЗаменяемыйСимвол = """";
	
	АдресВебСервер = Сред(АдресВебСервер, СтрНайти(АдресВебСервер, ЗаменяемыйСимвол) + 1);
	АдресВебСервер = Сред(АдресВебСервер, 1, СтрНайти(АдресВебСервер, ЗаменяемыйСимвол, НаправлениеПоиска.СКонца) - 1);
	
	Возврат АдресВебСервер;
КонецФункции

// Проверяет строку на то, что это строка соединения с информационной базой
// 
// Параметры:
//  ПроверяемаяСтрока - Строка
// 
// Возвращаемое значение:
//  Булево - Это строка соединения
Функция ЭтоСтрокаСоединения(ПроверяемаяСтрока) Экспорт
	Возврат ЭтоФайловаяИнформационнаяБаза(ПроверяемаяСтрока)
		ИЛИ ЭтоСервернаяИнформационнаяБаза(ПроверяемаяСтрока)
		ИЛИ ЭтоВебСервернаяИнформационнаБаза(ПроверяемаяСтрока);
КонецФункции

// Проверяет строку подключения на то, что это строка подключения к файловой ИБ
// 
// Параметры:
//  СтрокаСоединения - Строка - строка подключения к ИБ
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоФайловаяИнформационнаяБаза(СтрокаСоединения) Экспорт
	Шаблон = СтрШаблон("^%2%1"".*"";$",
		РазделительКлючаИЗначенияСтрокиПодключения(),
		КлючФайловойИнформационнойБазы()
	);

	Возврат СтрПодобнаПоРегулярномуВыражению(СтрокаСоединения, Шаблон);
КонецФункции

// Проверяет строку соединения на то, что это строка подключения к серверной ИБ
// 
// Параметры:
//  СтрокаСоединения - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоСервернаяИнформационнаяБаза(СтрокаСоединения) Экспорт
	 Шаблон = СтрШаблон("^%3%1"".*""%2%4%1"".*"";$",
	 	РазделительКлючаИЗначенияСтрокиПодключения(),
	 	РазделительКлючейСтрокиПодключения(),
	 	КлючИмениСервераИнформационнойБазы(),
	 	КлючИмениИнформационнойБазыНаСервере()
	 );
	 
	 Возврат СтрПодобнаПоРегулярномуВыражению(СтрокаСоединения, Шаблон);
КонецФункции

// Проверяет строку соединения на то, что это строка подключения к веб-серверной ИБ
// 
// Параметры:
//  СтрокаСоединения - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоВебСервернаяИнформационнаБаза(СтрокаСоединения) Экспорт
	Шаблон = СтрШаблон("^%2%1"".*"";$",
		РазделительКлючаИЗначенияСтрокиПодключения(),
		КлючВебСервернойИнформационнойБазы()
	);
	
	Возврат СтрПодобнаПоРегулярномуВыражению(СтрокаСоединения, Шаблон);
КонецФункции

Функция КлючФайловойИнформационнойБазы() Экспорт
	Возврат "File";
КонецФункции

Функция КлючИмениСервераИнформационнойБазы() Экспорт
	Возврат "Srvr";
КонецФункции

Функция КлючИмениИнформационнойБазыНаСервере() Экспорт
	Возврат "Ref";
КонецФункции

Функция КлючВебСервернойИнформационнойБазы() Экспорт
	Возврат "ws";
КонецФункции

Функция РазделительКлючаИЗначенияСтрокиПодключения() Экспорт
	Возврат "=";
КонецФункции

Функция РазделительКлючейСтрокиПодключения() Экспорт
	Возврат ";";
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет обязательные свойства в элемент списка информационных баз
// 
// Параметры:
//  Приемник - Структура
Процедура ДобавитьОбязательныеСвойстваЭлементаСписка(Приемник)
	Приемник.Вставить("Идентификатор", ОбщегоНазначенияКлиентСервер.ЗначениеПустогоУникальногоИдентификатора());
	Приемник.Вставить("Заголовок", ОбщегоНазначенияКлиентСервер.ЗначениеПустойСтроки());
	Приемник.Вставить("ПорядокВСписке", 0);
	Приемник.Вставить("Папка", ОбщегоНазначенияКлиентСервер.ЗначениеПустойСтроки());
КонецПроцедуры

// Возвращает преобразованный в идентификатор элемента списка
// 
// Параметры:
//  Данные - КлючИЗначение
// 
// Возвращаемое значение:
//  - УникальныйИдентификатор - успешно преобразовано
//  - Неопределено - не удалось преобразовать
Функция ИдентификаторЭлементаСписка(Данные)
	Значение = Данные.Значение.Получить(КлючИдентификатора());
	
	//@skip-check invocation-parameter-type-intersect
	ЭтоИдентификаторСписка = Значение <> Неопределено
		И ОбщегоНазначенияКлиентСервер.ЭтоСтрока(Значение)
		И ОбщегоНазначения.ЭтоУникальныйИдентификатор(Значение);
	
	Возврат ?(ЭтоИдентификаторСписка, Новый УникальныйИдентификатор(Значение), Неопределено);
КонецФункции

// Возвращает путь к папке элемента списка
// 
// Параметры:
//  Данные - КлючИЗначение
// 
// Возвращаемое значение:
//  Строка - полный путь к элементу списка в структуре папок, или, если ключа нет нет, то смотри РазделительПапок
Функция ПапкаЭлементаСписка(Данные)
	Значение = Данные.Значение.Получить(КлючПапки());
	
	Возврат ?(Значение <> Неопределено И ОбщегоНазначенияКлиентСервер.ЭтоСтрока(Значение),
		Значение,
		РазделительПапок()
	);
КонецФункции

// Возвращает скорость соединения с информационной базой
// 
// Параметры:
//  Данные - КлючИЗначение
// 
// Возвращаемое значение:
//  - Строка - скорость соединения, если значения нет в параметре Данные,
//      то смотри НормальнаяСкоростьСоединенияСИнформационнойБазой
Функция СкоростьСоединенияСИнформационнойБазой(Данные)
	Значение = Данные.Значение.Получить(КлючСкоростиСоединения());
	
	Возврат ?(Значение <> Неопределено И ОбщегоНазначенияКлиентСервер.ЭтоСтрока(Значение) И ЭтоСкоростьСоединенияСИнформационнойБазой(Значение),
		Значение,
		НормальнаяСкоростьСоединенияСИнформационнойБазой()
	);
КонецФункции

Функция ВерсияПлатформыИнформационнойБазы(Данные)
	Значение = Данные.Значение.Получить(КлючВерсииПлатформы());
	
	Возврат ?(Значение <> Неопределено И ОбщегоНазначенияКлиентСервер.ЭтоСтрока(Значение),
		Значение,
		Неопределено
	);
КонецФункции

#КонецОбласти