#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ОткрытьПредприятие(Команда)
	Если Элементы.СписокИБ.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Описание = ОписаниеЗапускаемойИБ(Элементы.СписокИБ.ТекущаяСтрока);
	
	Если Описание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Описание.ЭтоФайловая Тогда
		Ждать ИнформационныеБазыКлиент.ОткрытьПредприятиеФайловойБазы(Описание.ОписаниеИБ);
		
	ИначеЕсли Описание.ЭтоСерверная Тогда
		Ждать ИнформационныеБазыКлиент.ОткрытьПредприятиеСервернойБазы(Описание.ОписаниеИБ);
		
	ИначеЕсли Описание.ЭтоВебСерверная Тогда
		Ждать ИнформационныеБазыКлиент.ОткрытьПредприятиеВебСервернойБазы(Описание.ОписаниеИБ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОткрытьКонфигурацию(Команда)
	Если Элементы.СписокИБ.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Описание = ОписаниеЗапускаемойИБ(Элементы.СписокИБ.ТекущаяСтрока);
	
	Если Описание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Описание.ЭтоФайловая Тогда
		Ждать ИнформационныеБазыКлиент.ОткрытьКонфигураторФайловойБазы(Описание.ОписаниеИБ);
		
	ИначеЕсли Описание.ЭтоСерверная Тогда
		Ждать ИнформационныеБазыКлиент.ОткрытьКонфигураторСервернойБазы(Описание.ОписаниеИБ);
		
	ИначеЕсли Описание.ЭтоВебСерверная Тогда
		Ждать ИнформационныеБазыКлиент.ОткрытьКонфигураторВебСервернойБазы(Описание.ОписаниеИБ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлемент(Команда)
	ИнформационныеБазыКлиент.ОбработатьКомандуУдаленияЭлемента(ЭтотОбъект, Элементы.СписокИБ.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Асинх Процедура СоздатьИБ(Команда)
	ОповещениеЗакрытииФормыДобавления = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыДобавленияИБ", ЭтотОбъект);
	
	Ждать ИнформационныеБазыКлиент.СоздатьБазу(ОповещениеЗакрытииФормыДобавления, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОписаниеЗапускаемойИБ(Знач ИнформационнаяБаза)
	Описание = Новый Структура;
	Описание.Вставить("ЭтоФайловая", Ложь);
	Описание.Вставить("ЭтоСерверная", Ложь);
	Описание.Вставить("ЭтоВебСерверная", Ложь);
	Описание.Вставить("ЭтоГруппа", Ложь);
	Описание.Вставить("ОписаниеИБ");
	
	ЗапрашиваемыеДанные = Новый Структура;
	ЗапрашиваемыеДанные.Вставить("Заголовок", "Наименование");
	ЗапрашиваемыеДанные.Вставить("ЭтоГруппа", "ЭтоГруппа");
	ЗапрашиваемыеДанные.Вставить("ЭтоФайловая", "Тип = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.Файловая)");
	ЗапрашиваемыеДанные.Вставить("ЭтоСерверная", "Тип = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.Серверная)");
	ЗапрашиваемыеДанные.Вставить("ЭтоВебСерверная", "Тип = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.ВебСерверная)");
	ЗапрашиваемыеДанные.Вставить("ЗапретитьОткрыватьКонфигуратор", "ЗапретитьОткрыватьКонфигуратор");
	ЗапрашиваемыеДанные.Вставить("ПредупреждатьПередОткрытиемПредприятия", "ПредупреждатьПередОткрытиемПредприятия");
	ЗапрашиваемыеДанные.Вставить("ПутьКПапке", "ПутьКПапке");
	ЗапрашиваемыеДанные.Вставить("ИмяСервера", "ИмяСервера");
	ЗапрашиваемыеДанные.Вставить("ИмяБазыНаСервере", "ИмяБазыНаСервере");
	ЗапрашиваемыеДанные.Вставить("АдресВебСервера", "АдресВебСервера");
	ЗапрашиваемыеДанные.Вставить("ПутьКПапкеКВерсииПлатформы", "ВерсияПлатформы.ПутьКПапке");
	ЗапрашиваемыеДанные.Вставить("Логин", "ЕСТЬNULL(УчетныеДанныеПоУмолчанию.Логин, НЕОПРЕДЕЛЕНО)");
	ЗапрашиваемыеДанные.Вставить("Пароль", "ЕСТЬNULL(УчетныеДанныеПоУмолчанию.Пароль, НЕОПРЕДЕЛЕНО)");
	ДанныеИБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИнформационнаяБаза, ЗапрашиваемыеДанные);
	
	Если ДанныеИБ.ЭтоГруппа Тогда
		Возврат Неопределено;
		
	ИначеЕсли ДанныеИБ.ЭтоФайловая Тогда
		Описание.ЭтоФайловая = Истина;
		Описание.ОписаниеИБ = ИнформационныеБазыКлиентСервер.ОписаниеЗапускаемойФайловойИБ();
		
	ИначеЕсли ДанныеИБ.ЭтоСерверная Тогда
		Описание.ЭтоСерверная = Истина;
		Описание.ОписаниеИБ = ИнформационныеБазыКлиентСервер.ОписаниеЗапускаемойСервернойИБ();
		
	ИначеЕсли ДанныеИБ.ЭтоВебСерверная Тогда
		Описание.ЭтоВебСерверная = Истина;
		Описание.ОписаниеИБ = ИнформационныеБазыКлиентСервер.ОписаниеЗапускаемойВебСервернойИБ();
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Описание.ОписаниеИБ.Ссылка = ИнформационнаяБаза;
	ЗаполнитьЗначенияСвойств(Описание.ОписаниеИБ, ДанныеИБ);
	
	Возврат Описание;
КонецФункции

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыДобавленияИБ(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	Элементы.СписокИБ.Обновить();
КонецПроцедуры

#КонецОбласти
