#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ОткрытьПредприятие(Команда)
	ИнформационныеБазыКлиент.ОбработатьОткрытиеПредприятия(Элементы.СписокИБ.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОткрытьКонфигурацию(Команда)
	ИнформационныеБазыКлиент.ОбработатьОткрытиеКонфигуратор(Элементы.СписокИБ.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлемент(Команда)
	ИнформационныеБазыКлиент.ОбработатьКомандуУдаленияЭлемента(ЭтотОбъект, Элементы.СписокИБ.ТекущаяСтрока);
	
	Элементы.СписокИБ.Обновить();
КонецПроцедуры

&НаКлиенте
Асинх Процедура СоздатьИБ(Команда)
	ОповещениеЗакрытииФормыДобавления = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыДобавленияИБ", ЭтотОбъект);
	
	Ждать ИнформационныеБазыКлиент.СоздатьБазу(ОповещениеЗакрытииФормыДобавления, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыДобавленияИБ(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	Элементы.СписокИБ.Обновить();
КонецПроцедуры

#КонецОбласти
