#Область ОбработчикиСобытийТаблицыФормыСписокИБ

&НаКлиенте
Процедура СписокИБПриАктивизацииСтроки(Элемент)
	ВыбранныйЭлемент = Элементы.СписокИБ.ТекущаяСтрока;
	
	Если ЗначениеЗаполнено(ВыбранныйЭлемент) Тогда
		ЭтоНеГруппа = НЕ ЭлементЯвляетсяГруппой(ВыбранныйЭлемент);
		
		Элементы.СписокИБОткрытьПредприятие.Видимость = ЭтоНеГруппа;
		Элементы.СписокИБОткрытьКонфигурацию.Видимость = ЭтоНеГруппа;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ОткрытьПредприятие(Команда)
	ИнформационныеБазыКлиент.ОбработатьОткрытиеПредприятия(Элементы.СписокИБ.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОткрытьКонфигурацию(Команда)
	ИнформационныеБазыКлиент.ОбработатьОткрытиеКонфигуратор(Элементы.СписокИБ.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Асинх Процедура УдалитьЭлемент(Команда)
	Ждать ИнформационныеБазыКлиент.ОбработатьКомандуУдаленияЭлемента(ЭтотОбъект, Элементы.СписокИБ.ТекущаяСтрока);
	
	Элементы.СписокИБ.Обновить();
КонецПроцедуры

&НаКлиенте
Асинх Процедура СоздатьИБ(Команда)
	ОповещениеЗакрытииФормыДобавления = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыДобавленияИБ", ЭтотОбъект);
	
	Ждать ИнформационныеБазыКлиент.СоздатьБазу(ОповещениеЗакрытииФормыДобавления, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыДобавленияИБ(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	Элементы.СписокИБ.Обновить();
	
	Если Результат <> Неопределено Тогда
		Элементы.СписокИБ.ТекущаяСтрока = Результат;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭлементЯвляетсяГруппой(Элемент)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент, "ЭтоГруппа");
КонецФункции

#КонецОбласти
