#Область ПрограммныйИнтерфейс

Функция ОписаниеУдаляемогоЭлемента(ИнформационнаяБаза) Экспорт
	Возврат ИнформационныеБазы.ОписаниеУдаляемогоЭлемента(ИнформационнаяБаза);
КонецФункции

Функция ОписаниеЗапускаемойИБ(ИнформационнаяБаза) Экспорт
	Возврат ИнформационныеБазы.ОписаниеЗапускаемойИБ(ИнформационнаяБаза);
КонецФункции

Функция ПереполучитьСеансСКонфигуратором(ИнформационнаяБаза) Экспорт
	Возврат ИнформационныеБазы.ПереполучитьСеансСКонфигуратором(ИнформационнаяБаза);
КонецФункции

#КонецОбласти