#Область ОбработчикиЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура ПутьКФайлуСпискаИнформационныхБазНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл стандартного списка";
	Диалог.Фильтр = "Файл списка (*.v8i)|*.v8i";
	Диалог.МножественныйВыбор = Ложь;
	
	Если НЕ ПустаяСтрока(НаборКонстант.ПутьКФайлуСпискаИнформационныхБаз) Тогда
		Диалог.ПолноеИмяФайла = НаборКонстант.ПутьКФайлуСпискаИнформационныхБаз;
	КонецЕсли;
	
	ВыбранныеФайлы = Ждать Диалог.ВыбратьАсинх();
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		НаборКонстант.ПутьКФайлуСпискаИнформационныхБаз = ВыбранныеФайлы[0];
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
