#Область ПрограммныйИнтерфейс

Функция СоздатьГруппу(ОписаниеГруппы) Экспорт
	НоваяГруппа = Справочники.ИнформационныеБазы.СоздатьГруппу();
	НоваяГруппа.Наименование = ОписаниеГруппы.Заголовок;
	НоваяГруппа.Родитель = ОписаниеГруппы.Родитель;
	НоваяГруппа.Идентификатор = ОписаниеГруппы.УникальныйИдентификатор;
	
	НоваяГруппа.ПроверитьЗаполнение();
	
	НоваяГруппа.Записать();
	
	Возврат НоваяГруппа.Ссылка;
КонецФункции

Функция ОписаниеСоздаваемойГруппы() Экспорт
	Описание = Новый Структура;
	Описание.Вставить("Заголовок", ОбщегоНазначенияКлиентСервер.ЗначениеПустойСтроки());
	Описание.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор);
	Описание.Вставить("Родитель", Справочники.ИнформационныеБазы.ПустаяСсылка());
	
	Возврат Описание;
КонецФункции

Функция СоздатьФайловуюБазу(ОписаниеФайловойИБ) Экспорт
	НовыйЭлемент = Справочники.ИнформационныеБазы.СоздатьЭлемент();
	НовыйЭлемент.Тип = Перечисления.ТипыИнформационныхБаз.Файловая;
	НовыйЭлемент.Наименование = ОписаниеФайловойИБ.Заголовок;
	НовыйЭлемент.ПутьКПапке = ОписаниеФайловойИБ.ПутьКПапке;
	НовыйЭлемент.Родитель = ОписаниеФайловойИБ.Группа;
	НовыйЭлемент.ПредупреждатьПередОткрытиемПредприятия = ОписаниеФайловойИБ.ПредупреждатьПередОткрытиемПредприятия;
	НовыйЭлемент.ЗапретитьОткрыватьКонфигуратор = ОписаниеФайловойИБ.ЗапретитьОткрыватьКонфигуратор;
	НовыйЭлемент.СкоростьСоединения = ОписаниеФайловойИБ.СкоростьСоединения;
	НовыйЭлемент.ВерсияПлатформы = ОписаниеФайловойИБ.ВерсияПлатформы;
	
	НовыйЭлемент.ПроверитьЗаполнение();
	
	НовыйЭлемент.Записать();
КонецФункции

Функция ОписаниеСоздаваемойФайловойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияИБ(Описание);
	
	Описание.Вставить("Заголовок", Неопределено);
	Описание.Вставить("ПутьКПапке", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция СоздатьСервернуюБазу(ОписаниеСервернойИБ) Экспорт
	НовыйЭлемент = Справочники.ИнформационныеБазы.СоздатьЭлемент();
	НовыйЭлемент.Тип = Перечисления.ТипыИнформационныхБаз.Серверная;
	НовыйЭлемент.Наименование = ОписаниеСервернойИБ.Заголовок;
	НовыйЭлемент.Сервер = НайтиИлиСоздатьСервер(ОписаниеСервернойИБ.ИмяСервера);
	НовыйЭлемент.ИмяБазыНаСервере = ОписаниеСервернойИБ.ИмяБазыНаСервере;
	НовыйЭлемент.Родитель = ОписаниеСервернойИБ.Группа;
	НовыйЭлемент.ПредупреждатьПередОткрытиемПредприятия = ОписаниеСервернойИБ.ПредупреждатьПередОткрытиемПредприятия;
	НовыйЭлемент.ЗапретитьОткрыватьКонфигуратор = ОписаниеСервернойИБ.ЗапретитьОткрыватьКонфигуратор;
	НовыйЭлемент.СкоростьСоединения = ОписаниеСервернойИБ.СкоростьСоединения;
	НовыйЭлемент.ВерсияПлатформы = ОписаниеСервернойИБ.ВерсияПлатформы;
	
	НовыйЭлемент.ПроверитьЗаполнение();
	
	НовыйЭлемент.Записать();
КонецФункции

Функция ОписаниеСоздаваемойСервернойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияИБ(Описание);
	
	Описание.Вставить("Заголовок", Неопределено);
	Описание.Вставить("ИмяСервера", Неопределено);
	Описание.Вставить("ИмяБазыНаСервере", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция НайтиИлиСоздатьСервер(Адрес) Экспорт
	НайденныйСервер = Справочники.Серверы.НайтиПоАдресу(Адрес);
	Возврат ?(НайденныйСервер = Неопределено,
		Справочники.Серверы.СоздатьСервер(Адрес),
		НайденныйСервер
	);
КонецФункции

Функция СоздатьВебСервернуюБазу(ОписаниеВебСервернойИБ) Экспорт
	НовыйЭлемент = Справочники.ИнформационныеБазы.СоздатьЭлемент();
	НовыйЭлемент.Тип = Перечисления.ТипыИнформационныхБаз.ВебСерверная;
	НовыйЭлемент.Наименование = ОписаниеВебСервернойИБ.Заголовок;
	НовыйЭлемент.АдресВебСервера = ОписаниеВебСервернойИБ.АдресВебСервера;
	НовыйЭлемент.Родитель = ОписаниеВебСервернойИБ.Группа;
	НовыйЭлемент.ПредупреждатьПередОткрытиемПредприятия = ОписаниеВебСервернойИБ.ПредупреждатьПередОткрытиемПредприятия;
	НовыйЭлемент.ЗапретитьОткрыватьКонфигуратор = ОписаниеВебСервернойИБ.ЗапретитьОткрыватьКонфигуратор;
	НовыйЭлемент.СкоростьСоединения = ОписаниеВебСервернойИБ.СкоростьСоединения;
	НовыйЭлемент.ВерсияПлатформы = ОписаниеВебСервернойИБ.ВерсияПлатформы;
	
	НовыйЭлемент.ПроверитьЗаполнение();
	
	НовыйЭлемент.Записать();
КонецФункции

Функция ОписаниеСоздаваемойВебСервернойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияИБ(Описание);
	
	Описание.Вставить("Заголовок", Неопределено);
	Описание.Вставить("АдресВебСервера", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция ВерсияПлатформы(ПредставлениеВерсии) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВерсииПлатформы.Ссылка КАК Ссылка,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ втВерсииПлатформПоПриоритетам
	|ИЗ
	|	Справочник.ВерсииПлатформы КАК ВерсииПлатформы
	|ГДЕ
	|	&УсловиеПоКодуВерсии_
	|	И НЕ ВерсииПлатформы.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВерсииПлатформы.Ссылка,
	|	0
	|ИЗ
	|	Справочник.ВерсииПлатформы КАК ВерсииПлатформы
	|ГДЕ
	|	НЕ ВерсииПлатформы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	втВерсииПлатформПоПриоритетам.Ссылка КАК Ссылка
	|ИЗ
	|	втВерсииПлатформПоПриоритетам КАК втВерсииПлатформПоПриоритетам
	|
	|УПОРЯДОЧИТЬ ПО
	|	втВерсииПлатформПоПриоритетам.Приоритет УБЫВ";
	
	СоставВерсии = СтрРазделить(ПредставлениеВерсии, ".");
	
	Если СоставВерсии.Количество() = 4 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКодуВерсии_", "ВерсииПлатформы.Код = &Представление");
		
		Запрос.УстановитьПараметр("Представление", ПредставлениеВерсии);
		
	ИначеЕсли СоставВерсии.Количество() = 3 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКодуВерсии_", "ВерсииПлатформы.Код ПОДОБНО &Представление");
		
		Запрос.УстановитьПараметр("Представление", ПредставлениеВерсии + ".%");
		
	ИначеЕсли СоставВерсии.Количество() = 2 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКодуВерсии_", "ВерсииПлатформы.Код ПОДОБНО &Представление");
		
		Запрос.УстановитьПараметр("Представление", ПредставлениеВерсии + ".%.%");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКодуВерсии_", "ЛОЖЬ");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Представление", ПредставлениеВерсии);
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = ВыполненныйЗапрос.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
КонецФункции

Функция ОписаниеУдаляемогоЭлемента(ИнформационнаяБаза) Экспорт
	Описание = Новый Структура;
	Описание.Вставить("ЭтоФайловая", Ложь);
	Описание.Вставить("ЭтоСерверная", Ложь);
	Описание.Вставить("ЭтоВебСерверная", Ложь);
	Описание.Вставить("ЭтоГруппа", Ложь);
	Описание.Вставить("ОписаниеЭлемента");
	
	ЗапрашиваемыеДанные = Новый Структура;
	ЗапрашиваемыеДанные.Вставить("Ссылка", "Ссылка");
	ЗапрашиваемыеДанные.Вставить("Заголовок", "Наименование");
	ЗапрашиваемыеДанные.Вставить("ЭтоГруппа", "ЭтоГруппа");
	ЗапрашиваемыеДанные.Вставить("ЭтоФайловая", "Тип = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.Файловая)");
	ЗапрашиваемыеДанные.Вставить("ЭтоСерверная", "Тип = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.Серверная)");
	ЗапрашиваемыеДанные.Вставить("ЭтоВебСерверная", "Тип = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.ВебСерверная)");
	ЗапрашиваемыеДанные.Вставить("ПутьКПапке", "ПутьКПапке");
	ЗапрашиваемыеДанные.Вставить("ИмяСервера", "Сервер.АдресСервера");
	ЗапрашиваемыеДанные.Вставить("ИмяБазыНаСервере", "ИмяБазыНаСервере");
	ЗапрашиваемыеДанные.Вставить("АдресВебСервера", "АдресВебСервера");
	ЗапрашиваемыеДанные.Вставить("ПутьКПапкеКВерсииПлатформы", "ВерсияПлатформы.ПутьКПапке");
	ДанныеИБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИнформационнаяБаза, ЗапрашиваемыеДанные);
	
	Если ДанныеИБ.ЭтоГруппа Тогда
		Описание.ЭтоГруппа = Истина;
		Описание.ОписаниеЭлемента = ИнформационныеБазыКлиентСервер.ОписаниеУдаляемойГруппы();
		
	ИначеЕсли ДанныеИБ.ЭтоФайловая Тогда
		Описание.ЭтоФайловая = Истина;
		Описание.ОписаниеЭлемента = ИнформационныеБазыКлиентСервер.ОписаниеУдаляемойФайловойИБ();
		
	ИначеЕсли ДанныеИБ.ЭтоСерверная Тогда
		Описание.ЭтоСерверная = Истина;
		Описание.ОписаниеЭлемента = ИнформационныеБазыКлиентСервер.ОписаниеУдаляемойСервернойИБ();
		
	ИначеЕсли ДанныеИБ.ЭтоВебСерверная Тогда
		Описание.ЭтоВебСерверная = Истина;
		Описание.ОписаниеЭлемента = ИнформационныеБазыКлиентСервер.ОписаниеУдаляемойВебСервернойИБ();
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Описание.ОписаниеЭлемента, ДанныеИБ);
	
	Возврат Описание;
КонецФункции

Функция ОписаниеЗапускаемойИБ(ИнформационнаяБаза) Экспорт
	Описание = Новый Структура;
	Описание.Вставить("ЭтоФайловая", Ложь);
	Описание.Вставить("ЭтоСерверная", Ложь);
	Описание.Вставить("ЭтоВебСерверная", Ложь);
	Описание.Вставить("ЭтоГруппа", Ложь);
	Описание.Вставить("ОписаниеИБ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнформационныеБазы.Наименование КАК Заголовок,
	|	ИнформационныеБазы.ЭтоГруппа КАК ЭтоГруппа,
	|	ИнформационныеБазы.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.Файловая) КАК ЭтоФайловая,
	|	ИнформационныеБазы.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.Серверная) КАК ЭтоСерверная,
	|	ИнформационныеБазы.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.ВебСерверная) КАК ЭтоВебСерверная,
	|	ИнформационныеБазы.ЗапретитьОткрыватьКонфигуратор КАК ЗапретитьОткрыватьКонфигуратор,
	|	ИнформационныеБазы.ПредупреждатьПередОткрытиемПредприятия КАК ПредупреждатьПередОткрытиемПредприятия,
	|	ИнформационныеБазы.ПутьКПапке КАК ПутьКПапке,
	|	ИнформационныеБазы.Сервер.АдресСервера КАК ИмяСервера,
	|	ИнформационныеБазы.ИмяБазыНаСервере КАК ИмяБазыНаСервере,
	|	ИнформационныеБазы.АдресВебСервера КАК АдресВебСервера,
	|	ИнформационныеБазы.ВерсияПлатформы.ПутьКПапке КАК ПутьКПапкеКВерсииПлатформы,
	|	ЕСТЬNULL(ИнформационныеБазы.УчетныеДанныеПоУмолчанию.Логин, НЕОПРЕДЕЛЕНО) КАК Логин,
	|	ЕСТЬNULL(ИнформационныеБазы.УчетныеДанныеПоУмолчанию.Пароль, НЕОПРЕДЕЛЕНО) КАК Пароль,
	|	ЕСТЬNULL(СтатусыСеансовКонфигураторов.ЕстьСеанс, ЛОЖЬ) КАК ЕстьСеанс,
	|	ЕСТЬNULL(СтатусыСеансовКонфигураторов.Хост, НЕОПРЕДЕЛЕНО) КАК ХостСеанса
	|ИЗ
	|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыСеансовКонфигураторов КАК СтатусыСеансовКонфигураторов
	|		ПО (ИнформационныеБазы.Тип В (ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.Серверная), ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.Файловая)))
	|			И (СтатусыСеансовКонфигураторов.ИнформационнаяБаза = &ИнформационнаяБаза)
	|ГДЕ
	|	ИнформационныеБазы.Ссылка = &ИнформационнаяБаза";
	
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если Выборка.ЭтоГруппа Тогда
		Возврат Неопределено;
		
	ИначеЕсли Выборка.ЭтоФайловая Тогда
		Описание.ЭтоФайловая = Истина;
		Описание.ОписаниеИБ = ИнформационныеБазыКлиентСервер.ОписаниеЗапускаемойФайловойИБ();
		
	ИначеЕсли Выборка.ЭтоСерверная Тогда
		Описание.ЭтоСерверная = Истина;
		Описание.ОписаниеИБ = ИнформационныеБазыКлиентСервер.ОписаниеЗапускаемойСервернойИБ();
		
	ИначеЕсли Выборка.ЭтоВебСерверная Тогда
		Описание.ЭтоВебСерверная = Истина;
		Описание.ОписаниеИБ = ИнформационныеБазыКлиентСервер.ОписаниеЗапускаемойВебСервернойИБ();
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Описание.ОписаниеИБ.Ссылка = ИнформационнаяБаза;
	ЗаполнитьЗначенияСвойств(Описание.ОписаниеИБ, Выборка);
	
	Возврат Описание;
КонецФункции

Функция СеансСКонфигуратором(ИнформационнаяБаза) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыСеансовКонфигураторов.ЕстьСеанс КАК ЕстьСеанс,
	|	СтатусыСеансовКонфигураторов.Хост КАК Хост
	|ИЗ
	|	РегистрСведений.СтатусыСеансовКонфигураторов КАК СтатусыСеансовКонфигураторов
	|ГДЕ
	|	СтатусыСеансовКонфигураторов.ИнформационнаяБаза = &ИнформационнаяБаза";
	
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	Если ВыполненныйЗапрос.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = ВыполненныйЗапрос.Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьСеанс", Выборка.ЕстьСеанс);
	Результат.Вставить("Хост", Выборка.Хост);
	
	Возврат Результат;
КонецФункции

Функция ПереполучитьСеансСКонфигуратором(ИнформационнаяБаза) Экспорт
	ЗапрашиваемыеДанные = Новый Структура;
	ЗапрашиваемыеДанные.Вставить("Тип", "Тип");
	ЗапрашиваемыеДанные.Вставить("ПутьКПапке", "ПутьКПапке");
	ЗапрашиваемыеДанные.Вставить("ИмяБазыНаСервере", "ИмяБазыНаСервере");
	ЗапрашиваемыеДанные.Вставить("АдресСервера", "Сервер.АдресСервера");
	ЗапрашиваемыеДанные.Вставить("ПортАгентаСервера", "Сервер.ПортАгентаСервера");
	ЗапрашиваемыеДанные.Вставить("ПортКластера", "Сервер.Кластер.Порт");
	ЗапрашиваемыеДанные.Вставить("ИмяАдминистратораКластера", "Сервер.Кластер.ИмяАдминистратора");
	ЗапрашиваемыеДанные.Вставить("ПарольАдминистратораКластера", "Сервер.Кластер.ПарольАдминистратора");
	ЗапрашиваемыеДанные.Вставить("ВерсияПрограммы", "ВерсияПлатформы.Код");
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИнформационнаяБаза, ЗапрашиваемыеДанные);
	
	Результат = Новый Структура;
	Результат.Вставить("ЭтоФайловаяБаза", Данные.Тип = Перечисления.ТипыИнформационныхБаз.Файловая);
	Результат.Вставить("ЭтоСервернаяБаза", Данные.Тип = Перечисления.ТипыИнформационныхБаз.Серверная);
	Результат.Вставить("ЕстьСеанс", Ложь);
	
	Если Результат.ЭтоФайловаяБаза Тогда
		Результат.ЕстьСеанс = ЗаписатьСтатусСеансаКонфигуратораДляФайловойБазы(ИнформационнаяБаза, Данные.ПутьКПапке);
		Возврат Результат;
		
	ИначеЕсли Результат.ЭтоСервернаяБаза Тогда
		Данные.Вставить("Ссылка", ИнформационнаяБаза);
		Сеанс = ЗаписатьСтатусСеансаКонфигуратораДляСервернойБазы(Данные);
		
		Если Сеанс <> Неопределено Тогда
			Результат.ЕстьСеанс = Сеанс.ЕстьСеанс;
			Результат.Вставить("Хост", Сеанс.Хост);;
		КонецЕсли;
		
		Возврат Результат;
	КонецЕсли;
КонецФункции

#Область Форма

Процедура УстановитьНадписьСеансаСКонфигуратором(Форма, ИнформационнаяБаза) Экспорт
	СеансСКонфигуратором = ИнформационныеБазы.СеансСКонфигуратором(ИнформационнаяБаза);
	Если СеансСКонфигуратором = Неопределено Тогда
		Форма.Элементы.ФормаСтатусСеансаСКонфигуратором.Заголовок = "Сеанс: Неопределен";
	Иначе
		Форма.Элементы.ФормаСтатусСеансаСКонфигуратором.Заголовок = 
			?(СеансСКонфигуратором.ЕстьСеанс,
				СтрШаблон("Сеанс: %1", СеансСКонфигуратором.Хост),
				"Сеанс: <отсутствует>"
			);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПолучитьСтатусыСеансовКонфигураторов() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнформационныеБазы.Ссылка КАК Ссылка,
	|	ИнформационныеБазы.ПутьКПапке КАК ПутьКПапке
	|ИЗ
	|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	|ГДЕ
	|	ИнформационныеБазы.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.Файловая)
	|	И НЕ ИнформационныеБазы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнформационныеБазы.Ссылка КАК Ссылка,
	|	ИнформационныеБазы.ИмяБазыНаСервере КАК ИмяБазыНаСервере,
	|	ИнформационныеБазы.Сервер.АдресСервера КАК АдресСервера,
	|	ИнформационныеБазы.Сервер.ПортАгентаСервера КАК ПортАгентаСервера,
	|	ИнформационныеБазы.Сервер.Кластер.Порт КАК ПортКластера,
	|	ИнформационныеБазы.Сервер.Кластер.ИмяАдминистратора КАК ИмяАдминистратораКластера,
	|	ИнформационныеБазы.Сервер.Кластер.ПарольАдминистратора КАК ПарольАдминистратораКластера,
	|	ИнформационныеБазы.ВерсияПлатформы.Код КАК ВерсияПрограммы
	|ИЗ
	|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	|ГДЕ
	|	ИнформационныеБазы.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.Серверная)
	|	И НЕ ИнформационныеБазы.ПометкаУдаления";
	
	ВыполненныеЗапросы = Запрос.ВыполнитьПакет();
	
	ВыполненныйЗапросСФайловымиБазами = ВыполненныеЗапросы[0];
	Если НЕ ВыполненныйЗапросСФайловымиБазами.Пустой() Тогда
		Выборка = ВыполненныйЗапросСФайловымиБазами.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаписатьСтатусСеансаКонфигуратораДляФайловойБазы(Выборка.Ссылка, Выборка.ПутьКПапке);
		КонецЦикла;
	КонецЕсли;
	
	ВыполненныйЗапросССервернымиБазами= ВыполненныеЗапросы[1];
	Если НЕ ВыполненныйЗапросССервернымиБазами.Пустой() Тогда
		Выборка = ВыполненныйЗапросССервернымиБазами.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаписатьСтатусСеансаКонфигуратораДляСервернойБазы(Выборка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьОбщиеСвойстваОписанияИБ(Описание)
	Описание.Вставить("Группа", Неопределено);
	Описание.Вставить("ПредупреждатьПередОткрытиемПредприятия", Ложь);
	Описание.Вставить("ЗапретитьОткрыватьКонфигуратор", Ложь);
	Описание.Вставить("СкоростьСоединения", Перечисления.СкоростьСоединения.Нормальная);
	Описание.Вставить("ВерсияПлатформы", Неопределено);
КонецПроцедуры

Функция ЗаписатьСтатусСеансаКонфигуратораДляФайловойБазы(ИнформационнаяБаза, ПутьКПапке)
	Запись = РегистрыСведений.СтатусыСеансовКонфигураторов.СоздатьМенеджерЗаписи();
	Запись.ИнформационнаяБаза = ИнформационнаяБаза;
	Запись.ЕстьСеанс = ФайловаяБаза.ЕстьСеансСКонфигуратором(ПутьКПапке);
	Запись.Хост = "Этот компьютер";
	Запись.Записать(Истина);
	
	Возврат Запись.ЕстьСеанс;
КонецФункции

Функция ЗаписатьСтатусСеансаКонфигуратораДляСервернойБазы(Данные)
	Если НЕ (ЗначениеЗаполнено(Данные.ИмяБазыНаСервере)
			И ЗначениеЗаполнено(Данные.АдресСервера)
			И ЗначениеЗаполнено(Данные.ПортАгентаСервера)
			И ЗначениеЗаполнено(Данные.ПортКластера)
		)
		Тогда
		НаборЗаписей = РегистрыСведений.СтатусыСеансовКонфигураторов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(Данные.Ссылка);
		НаборЗаписей.Записать(Истина);
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеИБ = Новый Структура;
	ОписаниеИБ.Вставить("ИмяБазыВКластере", Данные.ИмяБазыНаСервере);
	ОписаниеИБ.Вставить("АдресСервера", Данные.АдресСервера);
	ОписаниеИБ.Вставить("ВерсияПрограммы", Данные.ВерсияПрограммы);
	ОписаниеИБ.Вставить("ПортАгентаСервера", Данные.ПортАгентаСервера);
	ОписаниеИБ.Вставить("ПортКластера", Данные.ПортКластера);
	ОписаниеИБ.Вставить("ИмяАдминистратораКластера", Данные.ИмяАдминистратораКластера);
	ОписаниеИБ.Вставить("ПарольАдминистратораКластера", Данные.ПарольАдминистратораКластера);
	РезультатПолученияСеанса = КонсольКластераКлиентСервер.СеансСКонфигуратором(ОписаниеИБ);
	
	Если РезультатПолученияСеанса.Успешно Тогда
		ЕстьСеанс = РезультатПолученияСеанса.Сеанс <> Неопределено;
		
		Запись = РегистрыСведений.СтатусыСеансовКонфигураторов.СоздатьМенеджерЗаписи();
		Запись.ИнформационнаяБаза = Данные.Ссылка;
		Запись.ЕстьСеанс = ЕстьСеанс;
		
		Если ЕстьСеанс Тогда
			Запись.НачалоСессии = РезультатПолученияСеанса.Сеанс.МоментСозданияСеанса;
			Запись.Хост = РезультатПолученияСеанса.Сеанс.ИмяКлиентскогоКомпьютера;
		Иначе
			Запись.НачалоСессии = Неопределено;
			Запись.Хост = Неопределено;
		КонецЕсли;
		
		Запись.Записать(Истина);
		
		Результат = Новый Структура;
		Результат.Вставить("ЕстьСеанс", Запись.ЕстьСеанс);
		Результат.Вставить("Хост", Запись.Хост);
		Возврат Результат;
	Иначе
		НаборЗаписей = РегистрыСведений.СтатусыСеансовКонфигураторов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(Данные.Ссылка);
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти