#Область ПрограммныйИнтерфейс

Функция СоздатьГруппу(ОписаниеГруппы) Экспорт
	НоваяГруппа = Справочники.ИнформационныеБазы.СоздатьГруппу();
	НоваяГруппа.Наименование = ОписаниеГруппы.Заголовок;
	НоваяГруппа.Родитель = ОписаниеГруппы.Родитель;
	НоваяГруппа.Идентификатор = ОписаниеГруппы.УникальныйИдентификатор;
	
	НоваяГруппа.ПроверитьЗаполнение();
	
	НоваяГруппа.Записать();
	
	Возврат НоваяГруппа.Ссылка;
КонецФункции

Функция ОписаниеСоздаваемойГруппы() Экспорт
	Описание = Новый Структура;
	Описание.Вставить("Заголовок", ОбщегоНазначенияКлиентСервер.ЗначениеПустойСтроки());
	Описание.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор);
	Описание.Вставить("Родитель", Справочники.ИнформационныеБазы.ПустаяСсылка());
	
	Возврат Описание;
КонецФункции

Функция СоздатьФайловуюБазу(ОписаниеФайловойИБ) Экспорт
	НовыйЭлемент = Справочники.ИнформационныеБазы.СоздатьЭлемент();
	НовыйЭлемент.Тип = Перечисления.ТипыИнформационныхБаз.Файловая;
	НовыйЭлемент.Наименование = ОписаниеФайловойИБ.Заголовок;
	НовыйЭлемент.ПутьКПапке = ОписаниеФайловойИБ.ПутьКПапке;
	НовыйЭлемент.Родитель = ОписаниеФайловойИБ.Группа;
	НовыйЭлемент.ПредупреждатьПередОткрытиемПредприятия = ОписаниеФайловойИБ.ПредупреждатьПередОткрытиемПредприятия;
	НовыйЭлемент.ЗапретитьОткрыватьКонфигуратор = ОписаниеФайловойИБ.ЗапретитьОткрыватьКонфигуратор;
	НовыйЭлемент.СкоростьСоединения = ОписаниеФайловойИБ.СкоростьСоединения;
	НовыйЭлемент.ВерсияПлатформы = ОписаниеФайловойИБ.ВерсияПлатформы;
	
	НовыйЭлемент.ПроверитьЗаполнение();
	
	НовыйЭлемент.Записать();
КонецФункции

Функция ОписаниеСоздаваемойФайловойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияИБ(Описание);
	
	Описание.Вставить("Заголовок", Неопределено);
	Описание.Вставить("ПутьКПапке", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция СоздатьСервернуюБазу(ОписаниеСервернойИБ) Экспорт
	НовыйЭлемент = Справочники.ИнформационныеБазы.СоздатьЭлемент();
	НовыйЭлемент.Тип = Перечисления.ТипыИнформационныхБаз.Серверная;
	НовыйЭлемент.Наименование = ОписаниеСервернойИБ.Заголовок;
	НовыйЭлемент.ИмяСервера = ОписаниеСервернойИБ.ИмяСервера;
	НовыйЭлемент.ИмяБазыНаСервере = ОписаниеСервернойИБ.ИмяБазыНаСервере;
	НовыйЭлемент.Родитель = ОписаниеСервернойИБ.Группа;
	НовыйЭлемент.ПредупреждатьПередОткрытиемПредприятия = ОписаниеСервернойИБ.ПредупреждатьПередОткрытиемПредприятия;
	НовыйЭлемент.ЗапретитьОткрыватьКонфигуратор = ОписаниеСервернойИБ.ЗапретитьОткрыватьКонфигуратор;
	НовыйЭлемент.СкоростьСоединения = ОписаниеСервернойИБ.СкоростьСоединения;
	НовыйЭлемент.ВерсияПлатформы = ОписаниеСервернойИБ.ВерсияПлатформы;
	
	НовыйЭлемент.ПроверитьЗаполнение();
	
	НовыйЭлемент.Записать();
КонецФункции

Функция ОписаниеСоздаваемойСервернойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияИБ(Описание);
	
	Описание.Вставить("Заголовок", Неопределено);
	Описание.Вставить("ИмяСервера", Неопределено);
	Описание.Вставить("ИмяБазыНаСервере", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция СоздатьВебСервернуюБазу(ОписаниеВебСервернойИБ) Экспорт
	НовыйЭлемент = Справочники.ИнформационныеБазы.СоздатьЭлемент();
	НовыйЭлемент.Тип = Перечисления.ТипыИнформационныхБаз.ВебСерверная;
	НовыйЭлемент.Наименование = ОписаниеВебСервернойИБ.Заголовок;
	НовыйЭлемент.АдресВебСервера = ОписаниеВебСервернойИБ.АдресВебСервера;
	НовыйЭлемент.Родитель = ОписаниеВебСервернойИБ.Группа;
	НовыйЭлемент.ПредупреждатьПередОткрытиемПредприятия = ОписаниеВебСервернойИБ.ПредупреждатьПередОткрытиемПредприятия;
	НовыйЭлемент.ЗапретитьОткрыватьКонфигуратор = ОписаниеВебСервернойИБ.ЗапретитьОткрыватьКонфигуратор;
	НовыйЭлемент.СкоростьСоединения = ОписаниеВебСервернойИБ.СкоростьСоединения;
	НовыйЭлемент.ВерсияПлатформы = ОписаниеВебСервернойИБ.ВерсияПлатформы;
	
	НовыйЭлемент.ПроверитьЗаполнение();
	
	НовыйЭлемент.Записать();
КонецФункции

Функция ОписаниеСоздаваемойВебСервернойИБ() Экспорт
	Описание = Новый Структура;
	
	ДобавитьОбщиеСвойстваОписанияИБ(Описание);
	
	Описание.Вставить("Заголовок", Неопределено);
	Описание.Вставить("АдресВебСервера", Неопределено);
	
	Возврат Описание;
КонецФункции

Функция ВерсияПлатформы(ПредставлениеВерсии) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВерсииПлатформы.Ссылка КАК Ссылка,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ втВерсииПлатформПоПриоритетам
	|ИЗ
	|	Справочник.ВерсииПлатформы КАК ВерсииПлатформы
	|ГДЕ
	|	&УсловиеПоКодуВерсии_
	|	И НЕ ВерсииПлатформы.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВерсииПлатформы.Ссылка,
	|	0
	|ИЗ
	|	Справочник.ВерсииПлатформы КАК ВерсииПлатформы
	|ГДЕ
	|	НЕ ВерсииПлатформы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	втВерсииПлатформПоПриоритетам.Ссылка КАК Ссылка
	|ИЗ
	|	втВерсииПлатформПоПриоритетам КАК втВерсииПлатформПоПриоритетам
	|
	|УПОРЯДОЧИТЬ ПО
	|	втВерсииПлатформПоПриоритетам.Приоритет УБЫВ";
	
	СоставВерсии = СтрРазделить(ПредставлениеВерсии, ".");
	
	Если СоставВерсии.Количество() = 4 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКодуВерсии_", "ВерсииПлатформы.Код = &Представление");
		
		Запрос.УстановитьПараметр("Представление", ПредставлениеВерсии);
		
	ИначеЕсли СоставВерсии.Количество() = 3 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКодуВерсии_", "ВерсииПлатформы.Код ПОДОБНО &Представление");
		
		Запрос.УстановитьПараметр("Представление", ПредставлениеВерсии + ".%");
		
	ИначеЕсли СоставВерсии.Количество() = 2 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКодуВерсии_", "ВерсииПлатформы.Код ПОДОБНО &Представление");
		
		Запрос.УстановитьПараметр("Представление", ПредставлениеВерсии + ".%.%");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКодуВерсии_", "ЛОЖЬ");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Представление", ПредставлениеВерсии);
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = ВыполненныйЗапрос.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьОбщиеСвойстваОписанияИБ(Описание)
	Описание.Вставить("Группа", Неопределено);
	Описание.Вставить("ПредупреждатьПередОткрытиемПредприятия", Ложь);
	Описание.Вставить("ЗапретитьОткрыватьКонфигуратор", Ложь);
	Описание.Вставить("СкоростьСоединения", Перечисления.СкоростьСоединения.Нормальная);
	Описание.Вставить("ВерсияПлатформы", Неопределено);
КонецПроцедуры

#КонецОбласти