#Область ПрограммныйИнтерфейс

Функция НайтиПоАдресу(Адрес) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "";
	
	Запрос.УстановитьПараметр("Адрес", Адрес);
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	Если ВыполненныйЗапрос = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = ВыполненныйЗапрос.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
КонецФункции

Функция СоздатьСервер(Адрес) Экспорт
	Объект = Справочники.Серверы.СоздатьЭлемент();
	Объект.АдресСервера = Адрес;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
КонецФункции

#КонецОбласти