#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьСтандартныйСписокИБ(Команда)
	ПолучитьСтандартныйСписокИБНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИмпортироватьСтандартныйСписокИБ(Команда)
	ИмпортироватьСтандартныйСписокИБНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьСтандартныйСписокИБНаСервере()
	ПутьКФайлу = СтандартныйСписокИнформационныхБаз.ПутьКФайлуСпискаИнформационныхБаз();
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен путь к файлу со стандартным списком ИБ.");
		Возврат;
	КонецЕсли;
	
	ПрочитанныйСписокИБ = СтандартныйСписокИнформационныхБаз.ПрочитатьФайлСпискаИнформационныхБаз(ПутьКФайлу);
	
	Если ПрочитанныйСписокИБ.ИнформационныеБазы.Количество() = 0 
		И ПрочитанныйСписокИБ.Группы.Количество() = 0
		Тогда
		Возврат;
	КонецЕсли;
	
	ИзменяемыйСтандартныйСписок = РеквизитФормыВЗначение("СтандартныйСписок", Тип("ДеревоЗначений"));
	
	ИзменяемыйСтандартныйСписок.Строки.Очистить();
	
	Для Каждого Группа Из ПрочитанныйСписокИБ.Группы Цикл
		ИменаПапок = СтандартныйСписокИнформационныхБаз.ИменаПапокЭлементаСписка(Группа.Папка);
		
		ДобавленнаяПапка = Неопределено;
		
		// Добавляем родителей
		Для Каждого ЗаголовокГруппы Из ИменаПапок Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("Заголовок", ЗаголовокГруппы);
			Отбор.Вставить("ЭтоГруппа", Истина);
			НайденнаяГруппа = ИзменяемыйСтандартныйСписок.Строки.НайтиСтроки(Отбор, Истина);
			
			Если НайденнаяГруппа.Количество() > 0 Тогда
				ДобавленнаяПапка = НайденнаяГруппа[0];
				Продолжить;
			КонецЕсли;
			
			ИдентификаторГруппы = ОписаниеРодительскойГруппы(ПрочитанныйСписокИБ.Группы, ЗаголовокГруппы).Идентификатор;
			
			Если ДобавленнаяПапка = Неопределено Тогда
				ДобавленнаяПапка = ДобавитьСтрокуГруппу(ИзменяемыйСтандартныйСписок.Строки, ЗаголовокГруппы, ИдентификаторГруппы);
			Иначе
				ДобавленнаяПапка = ДобавитьСтрокуГруппу(ДобавленнаяПапка.Строки, ЗаголовокГруппы, ИдентификаторГруппы);
			КонецЕсли;
		КонецЦикла;
		
		// добавление самой группы
		Если ДобавленнаяПапка = Неопределено Тогда
			ДобавитьСтрокуГруппу(ИзменяемыйСтандартныйСписок.Строки, Группа.Заголовок, Группа.Идентификатор);
		Иначе
			ДобавитьСтрокуГруппу(ДобавленнаяПапка.Строки, Группа.Заголовок, Группа.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ИнформационнаяБаза Из ПрочитанныйСписокИБ.ИнформационныеБазы Цикл
		ИменаПапок = СтандартныйСписокИнформационныхБаз.ИменаПапокЭлементаСписка(ИнформационнаяБаза.Папка);
		
		Группа = Неопределено;
		
		Если ИменаПапок.Количество() > 0 Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Заголовок", ИменаПапок.Получить(ИменаПапок.ВГраница()));
			Отбор.Вставить("ЭтоГруппа", Истина);
			
			НайденнаяГруппа = ИзменяемыйСтандартныйСписок.Строки.НайтиСтроки(Отбор, Истина);
			
			Если НайденнаяГруппа.Количество() > 0 Тогда
				Группа = НайденнаяГруппа[0].Строки;
			Иначе
				Группа = ИзменяемыйСтандартныйСписок.Строки;
			КонецЕсли;
		Иначе
			Группа = ИзменяемыйСтандартныйСписок.Строки;
		КонецЕсли;
		
		НоваяСтрока = Группа.Добавить();
		НоваяСтрока.Заголовок = ИнформационнаяБаза.Заголовок;
		НоваяСтрока.ЭтоГруппа = Ложь;
		НоваяСтрока.СтрокаПодключения = ИнформационнаяБаза.СтрокаПодключения;
		НоваяСтрока.СкоростьСоединения = ИнформационнаяБаза.СкоростьСоединения;
		НоваяСтрока.Версия = ИнформационнаяБаза.ВерсияПлатформы;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ИзменяемыйСтандартныйСписок, "СтандартныйСписок");
КонецПроцедуры

// Добавляет в дерево строку с именем
// 
// Параметры:
//  Группы - Массив из см. СписокИнформационныхБаз.ОписаниеГруппы - 
//  ИмяИскомойГруппы - Строка
// 
// Возвращаемое значение:
//  Неопределено, Структура - Описание родительской группы:
// * Идентификатор - УникальныйИдентификатор - 
// * Заголовок - Строка - 
// * ПорядокВСписке - Число - 
// * Папка - Строка
&НаСервереБезКонтекста
Функция ОписаниеРодительскойГруппы(Группы, ИмяИскомойГруппы)
	Для Каждого Группа Из Группы Цикл
		Если Группа.Заголовок = ИмяИскомойГруппы Тогда
			Возврат Группа;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

// Добавить строку группу.
// 
// Параметры:
//  СтрокиДерева - СтрокаДереваЗначений
//  ЗаголовокГруппы - Строка
//  ИдентификаторГруппы - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  СтрокаДереваЗначений
&НаСервереБезКонтекста
Функция ДобавитьСтрокуГруппу(СтрокиДерева, ЗаголовокГруппы, ИдентификаторГруппы)
	НоваяСтрока = СтрокиДерева.Добавить();
	НоваяСтрока.Заголовок = ЗаголовокГруппы;
	НоваяСтрока.ЭтоГруппа = Истина;
	НоваяСтрока.ИдентификаторЭлемента = ИдентификаторГруппы;
	
	Возврат НоваяСтрока;
КонецФункции

&НаСервере
Процедура ИмпортироватьСтандартныйСписокИБНаСервере()
	ИзменяемыйСтандартныйСписок = РеквизитФормыВЗначение("СтандартныйСписок", Тип("ДеревоЗначений"));
	
	Если ИзменяемыйСтандартныйСписок.Строки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нажми-ка на кнопку и посмотри, что импортировать, умник.");
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ИзменяемыйСтандартныйСписок.Строки Цикл
		Если Строка.ЭтоГруппа Тогда
			ИмпортироватьГруппу(Строка);
		Иначе
			ИмпортироватьИБ(Строка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ИмпортироватьГруппу(Строка, ГруппаРодитель = Неопределено)
	ОписаниеГруппы = ИнформационныеБазы.ОписаниеСоздаваемойГруппы();
	ОписаниеГруппы.Заголовок = Строка.Заголовок;
	ОписаниеГруппы.УникальныйИдентификатор = Строка.ИдентификаторЭлемента;
	
	Если НЕ ГруппаРодитель = Неопределено Тогда
		ОписаниеГруппы.Родитель = ГруппаРодитель;
	КонецЕсли;
	
	СозданнаяГруппа = ИнформационныеБазы.СоздатьГруппу(ОписаниеГруппы);
	
	Для Каждого ПодчиненнаяСтрока Из Строка.Строки Цикл
		Если ПодчиненнаяСтрока.ЭтоГруппа Тогда
			ИмпортироватьГруппу(ПодчиненнаяСтрока, СозданнаяГруппа);
		Иначе
			ИмпортироватьИБ(ПодчиненнаяСтрока, СозданнаяГруппа);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ИмпортироватьИБ(Строка, ГруппаРодитель = Неопределено)
	ОписаниеИБ = Неопределено;
	
	ЭтоФайловаяБаза = СтандартныйСписокИнформационныхБаз.ЭтоФайловаяИнформационнаяБаза(Строка.СтрокаПодключения);
	ЭтоСервернаяБаза = СтандартныйСписокИнформационныхБаз.ЭтоСервернаяИнформационнаяБаза(Строка.СтрокаПодключения);
	ЭтоВебСерверная = СтандартныйСписокИнформационныхБаз.ЭтоВебСервернаяИнформационнаБаза(Строка.СтрокаПодключения);
	
	Если ЭтоФайловаяБаза Тогда
		ОписаниеИБ = ИнформационныеБазы.ОписаниеСоздаваемойФайловойИБ();
		ОписаниеИБ.ПутьКПапке = СтандартныйСписокИнформационныхБаз.ПутьКПапкеФайловойИБ(Строка.СтрокаПодключения);
		
	ИначеЕсли ЭтоСервернаяБаза Тогда
		ОписаниеИБ = ИнформационныеБазы.ОписаниеСоздаваемойСервернойИБ();
		
		СоставСтрокиПодключения = СтандартныйСписокИнформационныхБаз.СоставСтрокиПодключенияСервернойИБ(Строка.СтрокаПодключения);
		
		ОписаниеИБ.ИмяСервера = СоставСтрокиПодключения.ИмяСервера;
		ОписаниеИБ.ИмяБазыНаСервере = СоставСтрокиПодключения.ИмяБазы;
		
	ИначеЕсли ЭтоВебСерверная Тогда
		ОписаниеИБ = ИнформационныеБазы.ОписаниеСоздаваемойВебСервернойИБ();
		ОписаниеИБ.АдресВебСервера = СтандартныйСписокИнформационныхБаз.АдресВебСервенойИБ(Строка.СтрокаПодключения);
	КонецЕсли;
	
	Если ОписаниеИБ = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось импортировать ИБ ""%1""", Строка.Заголовок));
		Возврат;
	КонецЕсли;
	
	Если НЕ ГруппаРодитель = Неопределено Тогда
		ОписаниеИБ.Группа = ГруппаРодитель;
	КонецЕсли;
	
	ОписаниеИБ.Заголовок = Строка.Заголовок;
	ОписаниеИБ.ВерсияПлатформы = ИнформационныеБазы.ВерсияПлатформы(Строка.Версия);
	
	Если ЭтоФайловаяБаза Тогда
		ИнформационныеБазы.СоздатьФайловуюБазу(ОписаниеИБ);
		
	ИначеЕсли ЭтоСервернаяБаза Тогда
		ИнформационныеБазы.СоздатьСервернуюБазу(ОписаниеИБ);
		
	ИначеЕсли ЭтоВебСерверная Тогда
		ИнформационныеБазы.СоздатьВебСервернуюБазу(ОписаниеИБ);
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти