#Область СлужебныйПрограммныйИнтерфейс

Процедура УдалитьЭлемент(Ссылка) Экспорт
	ИБОбъект = Ссылка.ПолучитьОбъект();
	ИБОбъект.Удалить();
КонецПроцедуры

Функция УчетныеДанные(ИнформационнаяБаза) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетныеДанные.Наименование КАК Наименование,
	|	УчетныеДанные.Логин КАК Логин,
	|	УчетныеДанные.Пароль КАК Пароль
	|ИЗ
	|	Справочник.УчетныеДанные КАК УчетныеДанные
	|ГДЕ
	|	(УчетныеДанные.ИнформационнаяБаза = &ИнформационнаяБаза
	|			ИЛИ УчетныеДанные.ИнформационнаяБаза = ЗНАЧЕНИЕ(Справочник.ИнформационныеБазы.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УчетныеДанные = Новый Массив;
	
	Выборка = ВыполненныйЗапрос.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеУчетнойЗаписи = Новый Структура;
		ДанныеУчетнойЗаписи.Вставить("Наименование", Выборка.Наименование);
		ДанныеУчетнойЗаписи.Вставить("Логин", Выборка.Логин);
		ДанныеУчетнойЗаписи.Вставить("Пароль", Выборка.Пароль);
		
		УчетныеДанные.Добавить(ДанныеУчетнойЗаписи);
	КонецЦикла;
	
	Возврат УчетныеДанные;
КонецФункции

#КонецОбласти