// @strict-types
#Область ПрограммныйИнтерфейс

// Читает текст файла
// 
// Параметры:
//  ПутьКФайлу - Строка - путь к ini-файлу
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие из Соответствие - соответствие, где ключами соответствия будут являться наименования секций (если нет секций, то пустая строка),
//    а значениями соответствия - структуры, где ключами будут являться имена свойств секции, а значениями - значения секций
//@skip-check doc-comment-collection-item-type
Функция ПрочитатьТекстФайла(ПутьКФайлу) Экспорт
	ТекстФайлаСписка = ПрочитатьТекстаИзФайла(ПутьКФайлу);

	Если ТекстФайлаСписка = Неопределено Тогда
		Возврат Новый Соответствие;
	КонецЕсли;

	ПрочитанныеДанные = Новый Соответствие;

	СтрокиФайлаСписка = СтрРазделить(ТекстФайлаСписка, РазделительПараметровСекции());

	ДанныеСекции = Неопределено;

	Для Каждого Строка Из СтрокиФайлаСписка Цикл
		Если ДанныеСекции = Неопределено Тогда
			ДанныеСекции = Новый Соответствие;
			
			ПрочитанныеДанные.Вставить(
				?(ЭтоЗаголовокСекции(Строка), ЗаголовокСекции(Строка), ОбщегоНазначенияКлиентСервер.ЗначениеПустойСтроки()),
				ДанныеСекции
			);
			
		ИначеЕсли ЭтоЗаголовокСекции(Строка) Тогда
			ДанныеСекции = Новый Соответствие;
			ПрочитанныеДанные.Вставить(ЗаголовокСекции(Строка), ДанныеСекции);
		КонецЕсли;
		
		ПозицияСимволаРазделителяКлюча = СтрНайти(Строка, РазделительКлючаИЗначения());

		Если ПозицияСимволаРазделителяКлюча = 0 Тогда
			ДанныеСекции.Вставить(Строка);
		
		ИначеЕсли ПозицияСимволаРазделителяКлюча = 1 Тогда
			Продолжить;
			
		Иначе
			Ключ = Лев(Строка, ПозицияСимволаРазделителяКлюча - 1);
			Значение = Сред(Строка, ПозицияСимволаРазделителяКлюча + 1);
			
			ДанныеСекции.Вставить(Ключ, Значение);
		КонецЕсли;
		
	КонецЦикла;

	Возврат Новый ФиксированноеСоответствие(ПрочитанныеДанные);
КонецФункции

// Проверяет строку на то, что это заголовок секции
// 
// Параметры:
//  ПроверяемаяСтрока - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоЗаголовокСекции(ПроверяемаяСтрока) Экспорт
	Возврат СтрНачинаетсяС(ПроверяемаяСтрока, СимволНачалаЗаголовкаСекции())
		И СтрЗаканчиваетсяНа(ПроверяемаяСтрока, СимволОкончанияЗаголовкаСекции());
КонецФункции

// Возвращает строку из прочитанного файла как заголовок секции без служебных символов
// 
// Параметры:
//  Строка - Строка
// 
// Возвращаемое значение:
//  Строка - Заголовок секции
Функция ЗаголовокСекции(Знач Строка) Экспорт
	Строка = СтрЗаменить(Строка, СимволНачалаЗаголовкаСекции(), ОбщегоНазначенияКлиентСервер.ЗначениеПустойСтроки());
	Строка = СтрЗаменить(Строка, СимволОкончанияЗаголовкаСекции(), ОбщегоНазначенияКлиентСервер.ЗначениеПустойСтроки());

	Возврат Строка;
КонецФункции

// Возвращает символ начала заголовка секции
// 
// Возвращаемое значение:
//  Строка - Символ начала заголовка секции
Функция СимволНачалаЗаголовкаСекции() Экспорт
	Возврат "[";
КонецФункции

// Возвращает символ окончания заголовка секции
// 
// Возвращаемое значение:
//  Строка - Символ окончания заголовка секции
Функция СимволОкончанияЗаголовкаСекции() Экспорт
	Возврат "]";
КонецФункции

// Возвращает разделитель параметров секции
// 
// Возвращаемое значение:
//  Строка - Разделитель пар ключ значение
Функция РазделительПараметровСекции() Экспорт
	Возврат Символы.ПС
КонецФункции

// Возвращает разделитель ключа и значения параметра секции
// 
// Возвращаемое значение:
//  Строка - Разделитель ключа и значения
Функция РазделительКлючаИЗначения() Экспорт
	Возврат "="
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьТекстаИзФайла(ПутьКФайлу)
	Текст = Неопределено;
	
	ЧитательТекста = Новый ЧтениеТекста;
	
	ЧитательТекста.Открыть(ПутьКФайлу);
	
	Текст = ЧитательТекста.Прочитать();
	
	ЧитательТекста.Закрыть();
	
	Возврат Текст;
КонецФункции

#КонецОбласти