#Область ПрограммныйИнтерфейс

Процедура ОткрытьПредприятиеФайловойБазы(ОписаниеИБ) Экспорт
	Если ЗадатьВопросОбОткрытииПредприятия(ОписаниеИБ, ТипФайловойИБ()) Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационныеБазыСлужебныйКлиент.ОткрытьПредприятиеФайловойБазы(ОписаниеИБ);
КонецПроцедуры

Процедура ОткрытьКонфигураторФайловойБазы(ОписаниеИБ) Экспорт
	Если ЕслиНужноВывестиСообщениеОЗапретеОткрытияКонфигуратора(ОписаниеИБ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационныеБазыСлужебныйКлиент.ОткрытьКонфигураторФайловойБазы(ОписаниеИБ);
КонецПроцедуры

Процедура ОткрытьПредприятиеСервернойБазы(ОписаниеИБ) Экспорт
	Если ЗадатьВопросОбОткрытииПредприятия(ОписаниеИБ, ТипСервернойИБ()) Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационныеБазыСлужебныйКлиент.ОткрытьПредприятиеСервернойБазы(ОписаниеИБ);
КонецПроцедуры

Процедура ОткрытьКонфигураторСервернойБазы(ОписаниеИБ) Экспорт
	Если ЕслиНужноВывестиСообщениеОЗапретеОткрытияКонфигуратора(ОписаниеИБ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационныеБазыСлужебныйКлиент.ОткрытьКонфигураторСервернойБазы(ОписаниеИБ);
КонецПроцедуры

Процедура ОткрытьПредприятиеВебСервернойБазы(ОписаниеИБ) Экспорт
	Если ЗадатьВопросОбОткрытииПредприятия(ОписаниеИБ, ТипВебСервернойИБ()) Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационныеБазыСлужебныйКлиент.ОткрытьПредприятиеВебСервернойБазы(ОписаниеИБ);
КонецПроцедуры

Процедура ОткрытьКонфигураторВебСервернойБазы(ОписаниеИБ) Экспорт
	Если ЕслиНужноВывестиСообщениеОЗапретеОткрытияКонфигуратора(ОписаниеИБ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационныеБазыСлужебныйКлиент.ОткрытьКонфигураторВебСервернойБазы(ОписаниеИБ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗадатьВопросОбОткрытииПредприятия(ОписаниеИБ, ТипИБ) Экспорт
	Если ОписаниеИБ.ПредупреждатьПередОткрытиемПредприятия Тогда
		ДопПараметры = Новый Структура("ТипИБ, ОписаниеИБ", ТипИБ, ОписаниеИБ);
		
		ОповещениеОбОтветеНаВопрос = Новый ОписаниеОповещения("ОбработатьОтветНаВопросОбОткрытииПредприятия", ЭтотОбъект, ДопПараметры);
		ТекстВопроса = СтрШаблон("Вы уверены что хотите открыть ИБ ""%1"" в режиме предприятия?", ОписаниеИБ.Заголовок);
		Таймаут = 20;
		КнопкаПоУмолчанию = КодВозвратаДиалога.Нет;
		
		ПоказатьВопрос(ОповещениеОбОтветеНаВопрос,
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет,
			Таймаут,
			КнопкаПоУмолчанию,
			"Внимание!",
			КнопкаПоУмолчанию
		);
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Процедура ОбработатьОтветНаВопросОбОткрытииПредприятия(Ответ, ДопПараметры = Неопределено) Экспорт
	Если Ответ = КодВозвратаДиалога.Нет ИЛИ Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры.ТипИБ = ТипФайловойИБ() Тогда
		ИнформационныеБазыСлужебныйКлиент.ОткрытьПредприятиеФайловойБазы(ДопПараметры.ОписаниеИБ);
		
	ИначеЕсли ДопПараметры.ТипИБ = ТипСервернойИБ() Тогда
		ИнформационныеБазыСлужебныйКлиент.ОткрытьПредприятиеСервернойБазы(ДопПараметры.ОписаниеИБ);
		
	ИначеЕсли ДопПараметры.ТипИБ = ТипВебСервернойИБ() Тогда
		ИнформационныеБазыСлужебныйКлиент.ОткрытьПредприятиеВебСервернойБазы(ДопПараметры.ОписаниеИБ);
		
	КонецЕсли;
КонецПроцедуры

Функция ЕслиНужноВывестиСообщениеОЗапретеОткрытияКонфигуратора(ОписаниеИБ) Экспорт
	Если ОписаниеИБ.ЗапретитьОткрыватьКонфигуратор Тогда
		ТекстСообщения = СтрШаблон("Запрещено открывать конфигуратор ИБ ""%1""", ОписаниеИБ.Заголовок);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Процедура ДобавитьОбщиеСвойстваОписанияИБ(Описание)
	Описание.Вставить("ПредупреждатьПередОткрытиемПредприятия", Ложь);
	Описание.Вставить("ЗапретитьОткрыватьКонфигуратор", Ложь);
	Описание.Вставить("СкоростьСоединения", Неопределено);
	Описание.Вставить("ПутьКПапкеКВерсииПлатформы", Неопределено);
КонецПроцедуры

Функция ТипФайловойИБ()
	Возврат 1;
КонецФункции

Функция ТипСервернойИБ()
	Возврат 2;
КонецФункции

Функция ТипВебСервернойИБ()
	Возврат 3;
КонецФункции

#КонецОбласти