#Область ПрограммныйИнтерфейс

Процедура ОткрытьПредприятиеФайловойБазы(ОписаниеИБ) Экспорт
	Если ЗадатьВопросОбОткрытииПредприятия(ОписаниеИБ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационныеБазыСлужебныйКлиент.ОткрытьПредприятиеФайловойБазы(ОписаниеИБ);
КонецПроцедуры

Процедура ОткрытьКонфигураторФайловойБазы(ОписаниеИБ) Экспорт
	Если ЕслиНужноВывестиСообщениеОЗапретеОткрытияКонфигуратора(ОписаниеИБ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационныеБазыСлужебныйКлиент.ОткрытьКонфигураторФайловойБазы(ОписаниеИБ);
КонецПроцедуры

Процедура ОткрытьПредприятиеСервернойБазы(ОписаниеИБ) Экспорт
	Если ЗадатьВопросОбОткрытииПредприятия(ОписаниеИБ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационныеБазыСлужебныйКлиент.ОткрытьПредприятиеСервернойБазы(ОписаниеИБ);
КонецПроцедуры

Процедура ОткрытьКонфигураторСервернойБазы(ОписаниеИБ) Экспорт
	Если ЕслиНужноВывестиСообщениеОЗапретеОткрытияКонфигуратора(ОписаниеИБ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационныеБазыСлужебныйКлиент.ОткрытьКонфигураторСервернойБазы(ОписаниеИБ);
КонецПроцедуры

Процедура ОткрытьПредприятиеВебСервернойБазы(ОписаниеИБ) Экспорт
	Если ЗадатьВопросОбОткрытииПредприятия(ОписаниеИБ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационныеБазыСлужебныйКлиент.ОткрытьПредприятиеВебСервернойБазы(ОписаниеИБ);
КонецПроцедуры

Процедура ОткрытьКонфигураторВебСервернойБазы(ОписаниеИБ) Экспорт
	Если ЕслиНужноВывестиСообщениеОЗапретеОткрытияКонфигуратора(ОписаниеИБ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационныеБазыСлужебныйКлиент.ОткрытьКонфигураторВебСервернойБазы(ОписаниеИБ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗадатьВопросОбОткрытииПредприятия(ОписаниеИБ) Экспорт
	Если ОписаниеИБ.ПредупреждатьПередОткрытиемПредприятия Тогда
		ОповещениеОбОтветеНаВопрос = Новый ОписаниеОповещения("ОбработатьОтветНаВопросОбОткрытииПредприятия", ЭтотОбъект, ОписаниеИБ);
		ТекстВопроса = СтрШаблон("Вы уверены что хотите открыть ИБ ""%1"" в режиме предприятия?", ОписаниеИБ.Заголовок);
		Таймаут = 20;
		КнопкаПоУмолчанию = КодВозвратаДиалога.Нет;
		
		ПоказатьВопрос(ОповещениеОбОтветеНаВопрос,
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет,
			Таймаут,
			КнопкаПоУмолчанию,
			"Внимание!",
			КнопкаПоУмолчанию
		);
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Процедура ОбработатьОтветНаВопросОбОткрытииПредприятия(Ответ, ОписаниеИБ = Неопределено) Экспорт
	Если Ответ = КодВозвратаДиалога.Нет ИЛИ Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационныеБазыСлужебныйКлиент.ОткрытьПредприятиеФайловойБазы(ОписаниеИБ);
КонецПроцедуры

Функция ЕслиНужноВывестиСообщениеОЗапретеОткрытияКонфигуратора(ОписаниеИБ) Экспорт
	Если ОписаниеИБ.ЗапретитьОткрыватьКонфигуратор Тогда
		ТекстСообщения = СтрШаблон("Запрещено открывать конфигуратор ИБ ""%1""", ОписаниеИБ.Заголовок);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Процедура ДобавитьОбщиеСвойстваОписанияИБ(Описание)
	Описание.Вставить("ПредупреждатьПередОткрытиемПредприятия", Ложь);
	Описание.Вставить("ЗапретитьОткрыватьКонфигуратор", Ложь);
	Описание.Вставить("СкоростьСоединения", Неопределено);
	Описание.Вставить("ПутьКПапкеКВерсииПлатформы", Неопределено);
КонецПроцедуры

#КонецОбласти