#Область ПрограммныйИнтерфейс

#Область ОткрытиеПредприятия

Асинх Функция ОбработатьОткрытиеПредприятия(ОткрываемыйЭлемент) Экспорт
	Если ОткрываемыйЭлемент = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Описание = ИнформационныеБазыВызовСервера.ОписаниеЗапускаемойИБ(ОткрываемыйЭлемент);
	
	Если Описание = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Описание.ЭтоФайловая Тогда
		Ждать ИнформационныеБазыКлиент.ОткрытьПредприятиеФайловойБазы(Описание.ОписаниеИБ);
		
	ИначеЕсли Описание.ЭтоСерверная Тогда
		Ждать ИнформационныеБазыКлиент.ОткрытьПредприятиеСервернойБазы(Описание.ОписаниеИБ);
		
	ИначеЕсли Описание.ЭтоВебСерверная Тогда
		Ждать ИнформационныеБазыКлиент.ОткрытьПредприятиеВебСервернойБазы(Описание.ОписаниеИБ);
	КонецЕсли;
КонецФункции

Асинх Функция ОткрытьПредприятиеСервернойБазы(ОписаниеИБ) Экспорт
	Если ЗадатьВопросОбОткрытииПредприятия(ОписаниеИБ, ТипСервернойИБ()) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ждать ЗаполнитьУчетныеДанныеДляЗапуска(ОписаниеИБ);
	
	ПлатформаКлиент.ОткрытьПредприятиеСервернойБазы(ОписаниеИБ);
КонецФункции

Асинх Функция ОткрытьПредприятиеФайловойБазы(ОписаниеИБ) Экспорт
	Если ЗадатьВопросОбОткрытииПредприятия(ОписаниеИБ, ТипФайловойИБ()) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ждать ЗаполнитьУчетныеДанныеДляЗапуска(ОписаниеИБ);
	
	ПлатформаКлиент.ОткрытьПредприятиеФайловойБазы(ОписаниеИБ);
КонецФункции

Асинх Функция ОткрытьПредприятиеВебСервернойБазы(ОписаниеИБ) Экспорт
	Если ЗадатьВопросОбОткрытииПредприятия(ОписаниеИБ, ТипВебСервернойИБ()) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ждать ЗаполнитьУчетныеДанныеДляЗапуска(ОписаниеИБ);
	
	ПлатформаКлиент.ОткрытьПредприятиеВебСервернойБазы(ОписаниеИБ);
КонецФункции

#КонецОбласти

#Область ОткрытиеКонфигуратора

Асинх Функция ОбработатьОткрытиеКонфигуратор(ОткрываемыйЭлемент) Экспорт
	Если ОткрываемыйЭлемент = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Описание = ИнформационныеБазыВызовСервера.ОписаниеЗапускаемойИБ(ОткрываемыйЭлемент);
	
	Если Описание = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Описание.ЭтоФайловая Тогда
		Ждать ИнформационныеБазыКлиент.ОткрытьКонфигураторФайловойБазы(Описание.ОписаниеИБ);
		
	ИначеЕсли Описание.ЭтоСерверная Тогда
		Ждать ИнформационныеБазыКлиент.ОткрытьКонфигураторСервернойБазы(Описание.ОписаниеИБ);
		
	ИначеЕсли Описание.ЭтоВебСерверная Тогда
		Ждать ИнформационныеБазыКлиент.ОткрытьКонфигураторВебСервернойБазы(Описание.ОписаниеИБ);
	КонецЕсли;
КонецФункции

Асинх Функция ОткрытьКонфигураторФайловойБазы(ОписаниеИБ) Экспорт
	Если ЕслиНужноВывестиСообщениеОЗапретеОткрытияКонфигуратора(ОписаниеИБ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ждать ЗаполнитьУчетныеДанныеДляЗапуска(ОписаниеИБ);
	
	ПлатформаКлиент.ОткрытьКонфигураторФайловойБазы(ОписаниеИБ);
КонецФункции

Асинх Функция ОткрытьКонфигураторСервернойБазы(ОписаниеИБ) Экспорт
	Если ЕслиНужноВывестиСообщениеОЗапретеОткрытияКонфигуратора(ОписаниеИБ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ждать ЗаполнитьУчетныеДанныеДляЗапуска(ОписаниеИБ);
	
	ПлатформаКлиент.ОткрытьКонфигураторСервернойБазы(ОписаниеИБ);
КонецФункции

Асинх Функция ОткрытьКонфигураторВебСервернойБазы(ОписаниеИБ) Экспорт
	Если ЕслиНужноВывестиСообщениеОЗапретеОткрытияКонфигуратора(ОписаниеИБ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ждать ЗаполнитьУчетныеДанныеДляЗапуска(ОписаниеИБ);
	
	ПлатформаКлиент.ОткрытьКонфигураторВебСервернойБазы(ОписаниеИБ);
КонецФункции

#КонецОбласти

#Область УдалениеИБ

Процедура ОбработатьКомандуУдаленияЭлемента(Форма, ТекущаяСтрока) Экспорт
	Если Форма.Элементы.СписокИБ.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Описание = ИнформационныеБазыВызовСервера.ОписаниеУдаляемогоЭлемента(Форма.Элементы.СписокИБ.ТекущаяСтрока);
	
	Если Описание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Описание.ЭтоГруппа Тогда
		УдалитьГруппу(Описание.ОписаниеЭлемента);
		
	ИначеЕсли Описание.ЭтоФайловая Тогда
		УдалитьФайловуюБазу(Описание.ОписаниеЭлемента);
		
	ИначеЕсли Описание.ЭтоСерверная Тогда
		УдалитьСервернуюБазу(Описание.ОписаниеЭлемента);
		
	ИначеЕсли Описание.ЭтоВебСерверная Тогда
		УдалитьВебСервернуюБазу(Описание.ОписаниеЭлемента);
	КонецЕсли;
КонецПроцедуры

Процедура УдалитьГруппу(ОписаниеГруппы) Экспорт
	ЗадатьВопросОбУдаленииЭлемента(ОписаниеГруппы, ТипГруппы());
КонецПроцедуры

Процедура УдалитьФайловуюБазу(ОписаниеИБ) Экспорт
	ЗадатьВопросОбУдаленииЭлемента(ОписаниеИБ, ТипФайловойИБ());
КонецПроцедуры

Процедура УдалитьСервернуюБазу(ОписаниеИБ) Экспорт
	ЗадатьВопросОбУдаленииЭлемента(ОписаниеИБ, ТипСервернойИБ());
КонецПроцедуры

Процедура УдалитьВебСервернуюБазу(ОписаниеИБ) Экспорт
	ЗадатьВопросОбУдаленииЭлемента(ОписаниеИБ, ТипВебСервернойИБ());
КонецПроцедуры

#КонецОбласти

Асинх Функция СоздатьБазу(ОписаниеОповещенияЗакрытияФормыДобавления, ВладелецФормы = Неопределено) Экспорт
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодОтветаСоздатьНовуюБазу(), "Создать новую");
	Кнопки.Добавить(КодОтветаДобавитьСуществующую(), "Добавить существующую");
	Кнопки.Добавить(Неопределено, "Отмена");
	
	Ответ = Ждать ВопросАсинх("Выберите тип добавляемой информационной базы.", Кнопки);
	
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипДобавления = ?(Ответ = КодОтветаСоздатьНовуюБазу(),
		ИнформационныеБазыКлиентСервер.ТипДобавленияНоваяИБ(),
		ИнформационныеБазыКлиентСервер.ТипДобавленияСуществующаяИБ()
	);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДобавления", ТипДобавления);
	ОткрытьФорму("Справочник.ИнформационныеБазы.Форма.ФормаЭлемента", ПараметрыФормы, ВладелецФормы, , , ,
		ОписаниеОповещенияЗакрытияФормыДобавления);
КонецФункции

Асинх Функция УдалитьПапкуФайловойБазы(ПутьКПапке) Экспорт
	Папка = Новый Файл(ПутьКПапке);
	
	Если Ждать Папка.СуществуетАсинх() И Ждать Папка.ЭтоКаталогАсинх() Тогда
		Ждать УдалитьФайлыАсинх(Папка.ПолноеИмя);
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗадатьВопросОбОткрытииПредприятия(ОписаниеИБ, ТипИБ) Экспорт
	Если ОписаниеИБ.ПредупреждатьПередОткрытиемПредприятия Тогда
		ДопПараметры = Новый Структура("ТипИБ, ОписаниеИБ", ТипИБ, ОписаниеИБ);
		
		ОповещениеОбОтветеНаВопрос = Новый ОписаниеОповещения("ОбработатьОтветНаВопросОбОткрытииПредприятия", ЭтотОбъект, ДопПараметры);
		ТекстВопроса = СтрШаблон("Вы уверены что хотите открыть ИБ ""%1"" в режиме предприятия?", ОписаниеИБ.Заголовок);
		Таймаут = 20;
		КнопкаПоУмолчанию = КодВозвратаДиалога.Нет;
		
		ПоказатьВопрос(ОповещениеОбОтветеНаВопрос,
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет,
			Таймаут,
			КнопкаПоУмолчанию,
			"Внимание!",
			КнопкаПоУмолчанию
		);
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Процедура ОбработатьОтветНаВопросОбОткрытииПредприятия(Ответ, ДопПараметры = Неопределено) Экспорт
	Если Ответ = КодВозвратаДиалога.Нет ИЛИ Ответ = Неопределено ИЛИ Ответ = КодВозвратаДиалога.Таймаут Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры.ТипИБ = ТипФайловойИБ() Тогда
		ПлатформаКлиент.ОткрытьПредприятиеФайловойБазы(ДопПараметры.ОписаниеИБ);
		
	ИначеЕсли ДопПараметры.ТипИБ = ТипСервернойИБ() Тогда
		ПлатформаКлиент.ОткрытьПредприятиеСервернойБазы(ДопПараметры.ОписаниеИБ);
		
	ИначеЕсли ДопПараметры.ТипИБ = ТипВебСервернойИБ() Тогда
		ПлатформаКлиент.ОткрытьПредприятиеВебСервернойБазы(ДопПараметры.ОписаниеИБ);
		
	КонецЕсли;
КонецПроцедуры

Функция ЕслиНужноВывестиСообщениеОЗапретеОткрытияКонфигуратора(ОписаниеИБ) Экспорт
	Если ОписаниеИБ.ЗапретитьОткрыватьКонфигуратор Тогда
		ТекстСообщения = СтрШаблон("Запрещено открывать конфигуратор ИБ ""%1""", ОписаниеИБ.Заголовок);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Асинх Функция ЗаполнитьУчетныеДанныеДляЗапуска(ОписаниеИБ)
	Если ЗначениеЗаполнено(ОписаниеИБ.Логин) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УчетныеДанные = ИнформационныеБазыСлужебныйВызовСервера.УчетныеДанные(ОписаниеИБ.Ссылка);
	
	Если УчетныеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УчетныеДанныеДляВыбора = Новый СписокЗначений;
	УчетныеДанныеДляВыбора.Добавить(Неопределено, "<стандартное окно логина>");
	
	Для Каждого Элемент Из УчетныеДанные Цикл
		УчетныеДанныеДляВыбора.Добавить(Элемент, Элемент.Наименование);
	КонецЦикла;
	
	ВыбранныйЭлемент = Ждать УчетныеДанныеДляВыбора.ВыбратьЭлементАсинх();
	
	Если НЕ (ВыбранныйЭлемент = Неопределено ИЛИ ВыбранныйЭлемент.Значение = Неопределено) Тогда
		ОписаниеИБ.Логин = ВыбранныйЭлемент.Значение.Логин;
		ОписаниеИБ.Пароль = ВыбранныйЭлемент.Значение.Пароль;
	КонецЕсли;
КонецФункции

Процедура ЗадатьВопросОбУдаленииЭлемента(ОписаниеЭлемента, ТипЭлемента)
	ДопПараметры = Новый Структура("ТипЭлемента, ОписаниеЭлемента", ТипЭлемента, ОписаниеЭлемента);
	
	ОповещениеОбОтветеНаВопрос = Новый ОписаниеОповещения("ОбработатьОтветНаВопросОбУдаленииЭлемента", ЭтотОбъект, ДопПараметры);
	ТекстВопроса = СтрШаблон("Вы уверены что хотите УДАЛИТЬ элемент ""%1""?", ОписаниеЭлемента.Заголовок);
	Таймаут = 5;
	КнопкаПоУмолчанию = КодВозвратаДиалога.Нет;
	
	ПоказатьВопрос(ОповещениеОбОтветеНаВопрос,
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНет,
		Таймаут,
		КнопкаПоУмолчанию,
		"Внимание!",
		КнопкаПоУмолчанию
	);
КонецПроцедуры

Асинх Процедура ОбработатьОтветНаВопросОбУдаленииЭлемента(Ответ, ДопПараметры = Неопределено) Экспорт
	Если Ответ = Неопределено ИЛИ Ответ = КодВозвратаДиалога.Нет ИЛИ Ответ = КодВозвратаДиалога.Таймаут Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационныеБазыСлужебныйВызовСервера.УдалитьЭлемент(ДопПараметры.ОписаниеЭлемента.Ссылка);
	
	Если ДопПараметры.ТипЭлемента = ТипФайловойИБ() Тогда
		Ждать УдалитьПапкуФайловойБазы(ДопПараметры.ОписаниеЭлемента.ПутьКПапке);
	КонецЕсли;
КонецПроцедуры

Функция КодОтветаСоздатьНовуюБазу()
	Возврат 1;
КонецФункции

Функция КодОтветаДобавитьСуществующую()
	Возврат 2;
КонецФункции

#Область ТипыИБ

Функция ТипФайловойИБ()
	Возврат 1;
КонецФункции

Функция ТипСервернойИБ()
	Возврат 2;
КонецФункции

Функция ТипВебСервернойИБ()
	Возврат 3;
КонецФункции

Функция ТипГруппы()
	Возврат 4;
КонецФункции

#КонецОбласти

#КонецОбласти